Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
/******************************************************************************
 * File Name:   e_eeprom_xmc1.c
 *
 * Description: This sourcefile implements the necessary APIs to use the flash
 * memory as emulated EEPROM in XMC1000 MCUs.
 *
 * Related Document: See README.md
 *
 ******************************************************************************
 *
 * Copyright (c) 2015-2021, Infineon Technologies AG
 * All rights reserved.
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer,
 * must be included in all copies of the Software, in whole or in part, and
 * all derivative works of the Software, unless such copies or derivative
 * works are solely in the form of machine-executable object code generated by
 * a source language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 *****************************************************************************/

/*****************************************************************************
 * HEADER FILES
 ****************************************************************************/
#include "xmc1_e_eeprom.h"

#if UC_FAMILY == XMC1

/*****************************************************************************
 * MACROS
 ****************************************************************************/
/* Define WEAK attribute */
#if !defined(__WEAK)
#if defined ( __CC_ARM )
#define __WEAK __attribute__ ((weak))
#elif defined ( __ICCARM__ )
#define __WEAK __weak
#elif defined ( __GNUC__ )
#define __WEAK __attribute__ ((weak))
#elif defined ( __TASKING__ )
#define __WEAK __attribute__ ((weak))
#endif
#endif

/* Garbage Collection procedure States */
#define E_EEPROM_XMC1_GC_UNINT             (0x0U)
#define E_EEPROM_XMC1_GC_COPY_START        (0x1U)
#define E_EEPROM_XMC1_GC_READ_NXTBLOCK     (0x2U)
#define E_EEPROM_XMC1_GC_ERASE_PREV_BANK   (0x3U)
#define E_EEPROM_XMC1_GC_REQUESTED         (0x4U)
#define E_EEPROM_XMC1_GC_COPY_WRITE        (0x5U)
#define E_EEPROM_XMC1_GC_COPY_END          (0x6U)
#define E_EEPROM_XMC1_GC_NEXT_BANK_VALID   (0x7U)
#define E_EEPROM_XMC1_GC_MARK_END_ERASE1   (0x8U)
#define E_EEPROM_XMC1_GC_FAIL              (0x9U)
#define E_EEPROM_XMC1_GC_IDLE              (0xAU)

/* Prepare DFLASH states states */
#define E_EEPROM_XMC1_PREPFLASH_FF         (0x1U)
#define E_EEPROM_XMC1_PREPFLASH_2F         (0x4U)
#define E_EEPROM_XMC1_PREPFLASH_2E         (0x5U)


/* Cache Update states */ 
#define E_EEPROM_XMC1_CACHE_IDLE           (0U)
#define E_EEPROM_XMC1_CACHE_EMPTY_BLOCK    (1U)
#define E_EEPROM_XMC1_CACHE_NEXT_BLK       (2U)
#define E_EEPROM_XMC1_CACHE_UPDATE_DONE    (4U)

/* Bank BLOCK values, used to store current status of the DFLASH */
#define E_EEPROM_XMC1_ALL_ONES             ((uint32_t)0xFFFFFFFFU)
#define E_EEPROM_XMC1_ALL_ZEROS            ((uint32_t)0x00000000U)
#define E_EEPROM_XMC1_START_BIT            (0x80U)
#define E_EEPROM_XMC1_VALID_BIT            (0x40U)
#define E_EEPROM_XMC1_CRC_BIT              (0x10U)
#define E_EEPROM_XMC1_VALID_MASK           ((uint32_t)(0x00004000U))
#define E_EEPROM_XMC1_CRC_MASK             ((uint32_t)(0x00001000U))

/* Internal Block status macros for implementation*/
#define E_EEPROM_XMC1_BLOCK1_DATA_SIZE     (12U)
#define E_EEPROM_XMC1_BLOCK2_DATA_SIZE     (14U)
#define E_EEPROM_XMC1_8BIT_ALL_ONE         (0xFFU)
#define E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND  ((uint32_t)(0xFFU))
#define E_EEPROM_XMC1_CRC_SHIFT            (16U)
#define E_EEPROM_XMC1_DUMMY_CRC            (0xA5A50000U)
#define E_EEPROM_XMC1_MASK_CRC             (0xFFFF0000U)

/* Bank BLOCK offsets */
#define E_EEPROM_XMC1_NEXT_VALID_OFFSET    (0U)
#define E_EEPROM_XMC1_BEGIN_OFFSET         (E_EEPROM_XMC1_FLASH_BLOCK_SIZE)
#define E_EEPROM_XMC1_END_OF_COPY_OFFSET   (E_EEPROM_XMC1_FLASH_BLOCK_SIZE * 2U)
#define E_EEPROM_XMC1_END_ERASE_OFFSET     (E_EEPROM_XMC1_FLASH_BLOCK_SIZE * 3U)
#define E_EEPROM_XMC1_DATA_BLOCK_OFFSET    (E_EEPROM_XMC1_FLASH_BLOCK_SIZE * 16U)
#define E_EEPROM_XMC1_BLOCK1_DATA_OFFSET   (4U)
#define E_EEPROM_XMC1_BLOCK2_DATA_OFFSET   (2U)

#define E_EEPROM_XMC1_BLOCK_WRITE_IDLE     (0U)
#define E_EEPROM_XMC1_FIRST_BLOCK_WRITE    (1U)
#define E_EEPROM_XMC1_NEXT_BLOCK_WRITE     (2U)
#define E_EEPROM_XMC1_LAST_BLOCK_WRITE     (3U)

/* States to monitor Garbage Collection completion, if it was interrupted earlier due to reset */
#define E_EEPROM_XMC1_INIT_NORMAL1         (0x2EU) /* Bank0 = VALID        BANK 1 = ERASED */
#define E_EEPROM_XMC1_INIT_DATA_COPY1      (0x2AU) /* Bank0 = VALID        BANK 1 = COPY ON-GOING */
#define E_EEPROM_XMC1_INIT_COPY_DONE2      (0x0AU) /* Bank0 = COPY COMPLETED  BANK 1 = COPY ON-GOING */
#define E_EEPROM_XMC1_INIT_NEXT_VALID2     (0x02U) /* Bank0 = COPY COMPLETED  BANK 1 = VALID */
#define E_EEPROM_XMC1_INIT_END_ERASE2      (0xF2U) /* Bank0 = ERASE ON-GOING  BANK 1 = VALID */

#define E_EEPROM_XMC1_INIT_NORMAL2         (0xE2U) /* Bank1 = VALID        BANK 0 = ERASED */
#define E_EEPROM_XMC1_INIT_DATA_COPY2      (0xA2U) /* Bank1 = VALID        BANK 0 = COPY ON-GOING */
#define E_EEPROM_XMC1_INIT_COPY_DONE1      (0xA0U) /* Bank1 = COPY COMPLETED  BANK 0 = COPY ON-GOING */
#define E_EEPROM_XMC1_INIT_NEXT_VALID1     (0x20U) /* Bank1 = COPY COMPLETED  BANK 0 = VALID */
#define E_EEPROM_XMC1_INIT_END_ERASE1      (0x2FU) /* Bank1 = ERASE ON-GOING  BANK 0 = VALID */

#define E_EEPROM_XMC1_INIT_ALL_ERASED      (0xFFU)

#define E_EEPROM_XMC1_INIT_STATE_2D        (0x2DU)
#define E_EEPROM_XMC1_INIT_STATE_D2        (0xD2U)
#define E_EEPROM_XMC1_INIT_STATE_AD        (0xADU)
#define E_EEPROM_XMC1_INIT_STATE_DA        (0xDAU)
#define E_EEPROM_XMC1_INIT_STATE_0D        (0x0DU)
#define E_EEPROM_XMC1_INIT_STATE_D0        (0xD0U)
#define E_EEPROM_XMC1_INIT_STATE_AF        (0xAFU)
#define E_EEPROM_XMC1_INIT_STATE_FA        (0xFAU)
#define E_EEPROM_XMC1_INIT_STATE_0F        (0x0FU)
#define E_EEPROM_XMC1_INIT_STATE_F0        (0xF0U)

