Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
#define E_EEPROM_XMC1_VALID_STATE          ((uint32_t)(0x20U))
#define E_EEPROM_XMC1_COPY_COMPLETED       ((uint32_t)(0x00U))

#define E_EEPROM_XMC1_MARKER_MAX_SHIFT     ((uint32_t)(4U))
#define E_EEPROM_XMC1_MAX_WORDS_IN_BLOCK   ((uint32_t)(4U))
#define E_EEPROM_XMC1_PAGE1_EXTRA_WORDS    ((uint8_t)(48U))
#define E_EEPROM_XMC1_MARKER_POSITION      ((uint32_t)0x80U)

/** Marker states on Init GC operation */
#define E_EEPROM_XMC1_MB_0                 ((uint32_t)0x00U)
#define E_EEPROM_XMC1_MB_1                 ((uint32_t)0x01U)
#define E_EEPROM_XMC1_MB_WRITTEN           ((uint32_t)0x00U)
#define E_EEPROM_XMC1_MB_ERASED            ((uint32_t)0x0FU)
#define E_EEPROM_XMC1_MB_DIRTY             ((uint32_t)0xDDU)

#define E_EEPROM_XMC1_BOTH_BANKS_VALID     ((uint32_t)0U) /* Both banks have clean markers */
#define E_EEPROM_XMC1_BANK0_INVALID        ((uint32_t)1U) /* Bank 0 is having dirty marker */
#define E_EEPROM_XMC1_BANK1_INVALID        ((uint32_t)2U) /* Bank 1 is having dirty marker */
#define E_EEPROM_XMC1_BOTH_BANKS_INVALID   ((uint32_t)3U) /* Both banks are having dirty markers */

#define E_EEPROM_XMC1_TWO_BYTES            ((uint32_t)0x02U)
#define E_EEPROM_XMC1_TWO_BIT_POS          ((uint32_t)0x02U)
#define E_EEPROM_XMC1_FOUR_BYTES           ((uint32_t)0x04U)
#define E_EEPROM_XMC1_EIGHT_BYTES          ((uint32_t)0x08U)
#define E_EEPROM_XMC1_EIGHT_BIT_POS        ((uint32_t)0x08U)

#define E_EEPROM_XMC1_EXECUTE_CACHE_UPDATE (0x0U)
#define E_EEPROM_XMC1_EXECUTE_PREP_FLASH   (0x1U)
#define E_EEPROM_XMC1_EXECUTE_GC_STATE     (0x2U)

/** Internal limits bounds */
#define E_EEPROM_XMC1_MAX_BLOCK_COUNT      (10u)
#define E_EEPROM_XMC1_MAX_BLOCK_SIZE       (0x8000u)


/*****************************************************************************
 * GLOBAL DATA
 ****************************************************************************/
E_EEPROM_XMC1_t *e_eeprom_xmc1_handle;

/*****************************************************************************
 * LOCAL ROUTINES
 ****************************************************************************/
static void E_EEPROM_XMC1_lWriteSingleBlock(uint32_t const address, const uint32_t *const data);
static void E_EEPROM_XMC1_lReadSingleBlock(uint32_t const address, uint32_t *const data);
static void E_EEPROM_XMC1_lWriteSinglePage(uint32_t const address, const uint32_t *const data);
static void E_EEPROM_XMC1_lEraseSinglePage(uint32_t const address);
static uint32_t E_EEPROM_XMC1_lReadSingleWord(uint32_t const address);
static uint32_t E_EEPROM_XMC1_lGetFlashStatus(void);

static void E_EEPROM_XMC1_lInitDirtyStateMachine(void);
static void E_EEPROM_XMC1_lInitNormalStateMachine(void);
static void E_EEPROM_XMC1_lInitllegalStateMachine(void);
static uint32_t E_EEPROM_XMC1_lInitBank0NormalStateMachine(void);
static uint32_t E_EEPROM_XMC1_lInitBank1NormalStateMachine(void);
static uint32_t E_EEPROM_XMC1_lInitOtherNormalStateMachine(void);
static void E_EEPROM_XMC1_lInitGc(const uint32_t  marker_dirty_state);
static void E_EEPROM_XMC1_lInitGcNormalStates(uint32_t current_state, uint32_t next_process);
static void E_EEPROM_XMC1_lInitGcDataCopyState(uint32_t current_state, uint32_t marker_offset);

static void E_EEPROM_XMC1_lPrepareDFlash(void);
static void E_EEPROM_XMC1_lGarbageCollection(void);
static void E_EEPROM_XMC1_lSetMarkerBlockBuffer(void);
static void E_EEPROM_XMC1_lSetMarkerPageBuffer(uint32_t state);
static uint32_t E_EEPROM_XMC1_lReadVerifyMarker(uint32_t bank, uint32_t block);
static void E_EEPROM_XMC1_lErasedDirtyStateRecovery( uint32_t marker_offset);
static uint32_t E_EEPROM_XMC1_lReadMarkerBlocks(void);
static void E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery(uint32_t current_state ,
        uint32_t NextState,
        uint32_t page_addr_select);

static void E_EEPROM_XMC1_lUpdateCache(void);
static void E_EEPROM_XMC1_lEvalBlockStatus(void);
static void E_EEPROM_XMC1_lUpdateCurrBankInfo(void);
static uint32_t E_EEPROM_XMC1_lUpdateCacheBlockRead(void);
static uint32_t E_EEPROM_XMC1_lCacheEmptyBlkEval(uint32_t end_addr);

static uint32_t E_EEPROM_XMC1_lGetFreeDFLASHBlocks(void);
static uint32_t E_EEPROM_XMC1_lGetUsrBlockIndex(uint8_t block_number);
static uint32_t E_EEPROM_XMC1_lGetDFLASHPhysicalBlocks(uint32_t size);
static uint32_t E_EEPROM_XMC1_lGCWrite(uint32_t block_address);
static uint32_t E_EEPROM_XMC1_lEraseBank(uint32_t page_address);

static void E_EEPROM_XMC1_lHandleGcStartCopy(void);
static void E_EEPROM_XMC1_lHandleGcRequested(void);
static void E_EEPROM_XMC1_lHandleGcEndOfCopy(void);
static void E_EEPROM_XMC1_lHandleGcCopyWrite(void);
static void E_EEPROM_XMC1_lHandleGcOtherStates( uint32_t current_state, uint32_t next_state);
static uint32_t E_EEPROM_XMC1_lWriteDataBlock(void);
static uint32_t E_EEPROM_XMC1_lHandleInvalidReq(uint8_t block_number, uint32_t user_block_index);
static uint32_t E_EEPROM_XMC1_lHandleWriteReq(uint8_t block_number, uint8_t* data_buffer_ptr);
static uint32_t E_EEPROM_XMC1_lLocalWrite(uint8_t block_number,
        uint8_t* data_buffer_ptr,
        uint32_t invalidate);
static void E_EEPROM_XMC1_lPopulateNextBlock(uint8_t block_number,
        uint8_t* const user_data_buffer_ptr ,
        uint32_t block_size);
static void E_EEPROM_XMC1_lPopulateFirstBlock(uint8_t block_number, uint8_t* user_data_buffer_ptr, uint32_t block_size);
#ifdef E_EEPROM_XMC1_CRC_SW_ENABLED
static E_EEPROM_XMC1_OPERATION_STATUS_t E_EEPROM_XMC1_lReadBlockCrcStatus(uint8_t block_number,
        uint8_t* data_buffer_ptr,
        uint32_t block_size);
#endif
static uint32_t E_EEPROM_XMC1_lReadBlockContents(uint8_t *data_buffer_ptr, uint32_t length, uint32_t offset);
static uint32_t E_EEPROM_XMC1_lGetPrevData(uint8_t block_number);
static uint32_t E_EEPROM_XMC1_lSearchBlockCopy(uint8_t required_block_number,
        uint32_t read_addr ,
        uint32_t data_sec_start_addr);
/*
 *  These are global functions used only for internal testing purpose.
 *  Application code shall not use these variables by enabling E_EEPROM_XMC1_TEST_HOOK_ENABLE macro definition.
 */
#ifdef E_EEPROM_XMC1_TEST_HOOK_ENABLE
__WEAK void E_EEPROM_XMC1_TEST_HOOK_WriteSingleBlock(uint32_t const address, const uint32_t *const data)
{
}
__WEAK void E_EEPROM_XMC1_TEST_HOOK_ReadSingleBlock(uint32_t const address, uint32_t *const data)
{
}
__WEAK void E_EEPROM_XMC1_TEST_HOOK_WriteSinglePage(uint32_t const address, const uint32_t *const data)
{
}
__WEAK void E_EEPROM_XMC1_TEST_HOOK_EraseSinglePage(uint32_t const address)
{
}
__WEAK uint32_t E_EEPROM_XMC1_TEST_HOOK_ReadSingleWord(uint32_t const address)
{
    return (0U);
}
__WEAK uint32_t E_EEPROM_XMC1_TEST_HOOK_GetFlashStatus(void)
{
    return (0U);
}
#endif

