Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_Init
 ********************************************************************************
 * Summary:
 * Driver Module Initialization function. This service shall initialize the Flash
 * EEPROM Emulation module using the values provided by configuration set.
 *
 * Parameters:
 * handle_ptr
 *
 * Return:
 * E_EEPROM_XMC1_STATUS_t
 *
 *******************************************************************************/
E_EEPROM_XMC1_STATUS_t E_EEPROM_XMC1_Init(E_EEPROM_XMC1_t *const handle_ptr)
{
    uint32_t indx;
    uint32_t marker_state;

    e_eeprom_xmc1_handle = handle_ptr;

    XMC_ASSERT("E_EEPROM_XMC1_Write:Invalid Buffer Pointer", (handle_ptr != NULL));

    /* Check if the E_EEPROM_XMC1_Init API is called once*/
    if (handle_ptr->state != E_EEPROM_XMC1_STATUS_SUCCESS)
    {
#ifdef E_EEPROM_XMC1_CRC_SW_ENABLED
        handle_ptr->state = (E_EEPROM_XMC1_STATUS_t)CRC_SW_Init(handle_ptr->crc_handle_ptr);
        if (handle_ptr->state != E_EEPROM_XMC1_STATUS_SUCCESS)
        {
            handle_ptr->state = E_EEPROM_XMC1_STATUS_FAILURE;
        }
        else
#endif
        {
            /* Check max. block_count in configuration */
            if (handle_ptr-> block_count > E_EEPROM_XMC1_MAX_BLOCK_COUNT)
            {
               handle_ptr->state = E_EEPROM_XMC1_STATUS_FAILURE;
               return (handle_ptr->state);
            }
            /* Initialize the cache variables for the User defined Block configuration list */
            indx = 0U;
            do
            {
                E_EEPROM_XMC1_CACHE_t * block_ptr;

                if (E_EEPROM_XMC1_MAX_BLOCK_SIZE < handle_ptr->block_config_ptr[indx].size)
                {
                   handle_ptr->state = E_EEPROM_XMC1_STATUS_FAILURE;
                   return (handle_ptr->state);
                }

                block_ptr = &(handle_ptr->data_ptr->block_info[indx]);

                block_ptr->address = 0U;
                block_ptr->status.consistent = 0U;
                block_ptr->status.valid = 1U;
                block_ptr->status.copied = 0U;
                block_ptr->status.crc = 0U;
                indx++;
            } while (indx < handle_ptr->block_count);

            /********* Initialize all global variables *****************/
            handle_ptr->data_ptr->updated_cache_index = 0U;
            handle_ptr->data_ptr->cache_state = E_EEPROM_XMC1_CACHE_IDLE;
            handle_ptr->data_ptr->gc_state = E_EEPROM_XMC1_GC_UNINT;
            handle_ptr->data_ptr->init_gc_state = 0U;
            handle_ptr->data_ptr->gc_log_block_count = 0U;
            handle_ptr->data_ptr->crc_buffer = 0U;

            handle_ptr->data_ptr->written_block_counter = (uint32_t)0;
            handle_ptr->data_ptr->curr_bank_src_addr = 0U;
            handle_ptr->data_ptr->gc_src_addr = 0U;
            handle_ptr->data_ptr->gc_dest_addr = 0U;
            handle_ptr->data_ptr->next_free_block_addr = 0U;
            handle_ptr->data_ptr->gc_block_counter = (uint32_t)0;
            handle_ptr->data_ptr->user_write_bytes_count = 0U;

            handle_ptr->data_ptr->current_bank = 0U;

            XMC_FLASH_SetHardReadLevel(XMC_FLASH_HARDREAD_LEVEL_WRITTEN);

            /* Read the marker blocks from flash and decide the MARKER STATES */
            marker_state = E_EEPROM_XMC1_lReadMarkerBlocks();


            /*
             * Call INIT-GC state machine function to take decision on current MARKER STATE available.
             * Progress to GC state machine or PrepareDFLASH State machine after completing  the Cache update
             */
            E_EEPROM_XMC1_lInitGc(marker_state);

            /* If Initialization is done without any errors, set the INIT API called state into Initialized once */
            if (handle_ptr->data_ptr->gc_state == E_EEPROM_XMC1_GC_IDLE)
            {
                handle_ptr->state = E_EEPROM_XMC1_STATUS_SUCCESS;
            }
            else
            {
                handle_ptr->state = E_EEPROM_XMC1_STATUS_FAILURE;
            }
        }
    }
    return (handle_ptr->state);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_Write
 ********************************************************************************
 * Summary:
 * This function shall write user data block into flash
 *
 * Parameters:
 * block_number  - Number of logical block (Block-ID)
 * data_buffer_ptr - Pointer to user data buffer
 *
 * Return:
 * E_EEPROM_XMC1_OPERATION_STATUS_t
 *
 *******************************************************************************/
E_EEPROM_XMC1_OPERATION_STATUS_t E_EEPROM_XMC1_Write(uint8_t block_number, uint8_t *data_buffer_ptr)
{
    E_EEPROM_XMC1_OPERATION_STATUS_t status;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    XMC_ASSERT("E_EEPROM_XMC1_Write:Wrong Block Number", (E_EEPROM_XMC1_lGetUsrBlockIndex(block_number) !=
            E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND));
    XMC_ASSERT("E_EEPROM_XMC1_Write:Invalid Buffer Pointer", (data_buffer_ptr != NULL));

    status = E_EEPROM_XMC1_OPERATION_STATUS_NOT_ALLOWED;

    /* Execute only if there is no previous pending request and the GC process is in IDLE state */
    if (data_ptr->gc_state == E_EEPROM_XMC1_GC_IDLE)
    {
        /* Call local function to write the specified block of data into flash */
        status = (E_EEPROM_XMC1_OPERATION_STATUS_t)E_EEPROM_XMC1_lLocalWrite(block_number, data_buffer_ptr, 0U);
    }

    return((E_EEPROM_XMC1_OPERATION_STATUS_t)status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_InvalidateBlock
 ********************************************************************************
 * Summary:
 * This function shall invalidate user data block.
 *
 * Parameters:
 * block_number  - Number of logical block (Block-ID)
 *
 * Return:
 * E_EEPROM_XMC1_OPERATION_STATUS_t
 *
 *******************************************************************************/
E_EEPROM_XMC1_OPERATION_STATUS_t E_EEPROM_XMC1_InvalidateBlock(uint8_t block_number)
{
    uint8_t* data_buffer_ptr;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_OPERATION_STATUS_t status;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);
    XMC_ASSERT("E_EEPROM_XMC1_InvalidateBlock:Wrong Block Number", (E_EEPROM_XMC1_lGetUsrBlockIndex(block_number) !=
            E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND));
    data_buffer_ptr =  data_ptr->read_write_buffer;
    status = E_EEPROM_XMC1_OPERATION_STATUS_NOT_ALLOWED;

