Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
    /* Execute only if there is no previous pending request and the GC process is in IDLE state */
    if (data_ptr->gc_state == E_EEPROM_XMC1_GC_IDLE)
    {
        /* Call local function to write the specified block of data into flash */
        status = (E_EEPROM_XMC1_OPERATION_STATUS_t)E_EEPROM_XMC1_lLocalWrite( block_number, data_buffer_ptr ,1U);
    }

    return((E_EEPROM_XMC1_OPERATION_STATUS_t)status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_Read
 ********************************************************************************
 * Summary:
 * This function shall read user data blocks from flash.
 *
 * Parameters:
 * block_number  - Number of logical block
 * offset      - Start Location for Read start
 * data_buffer_ptr - Pointer to user data buffer
 * length      - End Location for read completion
 *
 * Return:
 * E_EEPROM_XMC1_OPERATION_STATUS_t
 *
 *******************************************************************************/
E_EEPROM_XMC1_OPERATION_STATUS_t E_EEPROM_XMC1_Read(uint8_t block_number,
        uint32_t offset,
        uint8_t *data_buffer_ptr,
        uint32_t length)
{
    uint32_t block_size;
    uint32_t user_block_index;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_OPERATION_STATUS_t status;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);
    user_block_index = E_EEPROM_XMC1_lGetUsrBlockIndex(block_number);
    block_size = e_eeprom_xmc1_handle->block_config_ptr[user_block_index].size;

    XMC_ASSERT("E_EEPROM_XMC1_Read:Wrong Block Number", (user_block_index  != E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND));
    XMC_ASSERT("E_EEPROM_XMC1_Read:Invalid Buffer Pointer", (data_buffer_ptr != NULL));

    status = E_EEPROM_XMC1_OPERATION_STATUS_NOT_ALLOWED;

    /*Execute only if GC process is in IDLE state */
    if ((data_ptr->gc_state == E_EEPROM_XMC1_GC_IDLE) && (((uint32_t)offset + length) <= block_size))
    {
        if (data_ptr->block_info[user_block_index].status.valid == 0U) /* If cache says Inconsistent */
        {
            status = E_EEPROM_XMC1_OPERATION_STATUS_INVALID_BLOCK;
        }
        else if (data_ptr->block_info[user_block_index].status.consistent == 0U) /* If cache says Invalid */
        {
            status = E_EEPROM_XMC1_OPERATION_STATUS_INCONSISTENT_BLOCK;
        }
        else
        {
            data_ptr->read_start_address = data_ptr->block_info[user_block_index].address;
            status = (E_EEPROM_XMC1_OPERATION_STATUS_t)E_EEPROM_XMC1_lReadBlockContents(data_buffer_ptr , length , offset);

            if ((uint32_t)status != 0U)
            {
                status = E_EEPROM_XMC1_OPERATION_STATUS_FAILURE;
            }
        }
    }
    return((E_EEPROM_XMC1_OPERATION_STATUS_t)status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_StartGarbageCollection
 ********************************************************************************
 * Summary:
 * This function shall start Garbage collection.
 *
 * Parameters:
 * void
 *
 * Return:
 * E_EEPROM_XMC1_OPERATION_STATUS_t
 *
 *******************************************************************************/
E_EEPROM_XMC1_OPERATION_STATUS_t E_EEPROM_XMC1_StartGarbageCollection(void)
{
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_OPERATION_STATUS_t status;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    status = E_EEPROM_XMC1_OPERATION_STATUS_NOT_ALLOWED;

    /* Check if the E_EEPROM_XMC1_Init API is called */
    if (data_ptr->gc_state == E_EEPROM_XMC1_GC_IDLE)
    {
        data_ptr->gc_state = E_EEPROM_XMC1_GC_REQUESTED;

        /* Call local function to start garbage collection process from scratch */
        E_EEPROM_XMC1_lGarbageCollection();

        if (data_ptr->gc_state == E_EEPROM_XMC1_GC_FAIL)
        {
            status = E_EEPROM_XMC1_OPERATION_STATUS_FAILURE;
        }
        else
        {
            status = E_EEPROM_XMC1_OPERATION_STATUS_SUCCESS;
        }
    }

    return((E_EEPROM_XMC1_OPERATION_STATUS_t)status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_GetStatus
 ********************************************************************************
 * Summary:
 * This function shall return the status of the APP
 *
 * Parameters:
 * void
 *
 * Return:
 * E_EEPROM_XMC1_STATUS_t
 *
 *******************************************************************************/
E_EEPROM_XMC1_STATUS_t E_EEPROM_XMC1_GetStatus(void)
{
    E_EEPROM_XMC1_STATUS_t status;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /* If the GC/InitGC has failed */
    if (data_ptr->gc_state == E_EEPROM_XMC1_GC_IDLE)
    {
        status = E_EEPROM_XMC1_STATUS_IDLE;
    }
    else if (data_ptr->gc_state == E_EEPROM_XMC1_GC_FAIL)
    {
        status = E_EEPROM_XMC1_STATUS_FAILURE;
    }
    else
    {
        status = E_EEPROM_XMC1_STATUS_BUSY;
    }

    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_IsGarbageCollectionNeeded
 ********************************************************************************
 * Summary:
 * This function returns the whether the block can be fit inside the bank or it
 * needs a garbage collection to fit in
 *
 * Parameters:
 * block_number
 *
 * Return:
 * bool
 *
 *******************************************************************************/
bool E_EEPROM_XMC1_IsGarbageCollectionNeeded(uint8_t block_number)
{
    bool status;
    uint32_t flash_blocks;
    uint32_t user_block_index;
    uint32_t remaining_blocks;
    E_EEPROM_XMC1_BLOCK_t *block_ptr;

    status = false;
    user_block_index = E_EEPROM_XMC1_lGetUsrBlockIndex(block_number);
    block_ptr = e_eeprom_xmc1_handle->block_config_ptr + user_block_index;

    XMC_ASSERT("E_EEPROM_XMC1_IsGarbageCollectionNeeded:Wrong Block Number", (user_block_index  !=
            E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND));

    flash_blocks = E_EEPROM_XMC1_lGetDFLASHPhysicalBlocks(block_ptr->size);
    remaining_blocks = E_EEPROM_XMC1_lGetFreeDFLASHBlocks();

    if (remaining_blocks < flash_blocks)
    {
        status = true;
    }

    return (status);
}

