Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
#ifdef E_EEPROM_XMC1_CRC_SW_ENABLED
/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_VerifyBlockCrcStatus
 ********************************************************************************
 * Summary:
 * It reads the complete data block from the flash and compare the CRC from header
 * block with the computed CRC using CRC_SW APP. Read from arbitrary location and
 * limited length is not possible under this API.
 *
 * Parameters:
 * block_number  - Number of logical block
 * data_buffer_ptr - Pointer to user data buffer
 *
 * Return:
 * E_EEPROM_XMC1_OPERATION_STATUS_t
 *
 *******************************************************************************/
E_EEPROM_XMC1_OPERATION_STATUS_t E_EEPROM_XMC1_VerifyBlockCrcStatus(uint8_t block_number, uint8_t *data_buffer_ptr)
{
    uint32_t block_size;
    uint32_t user_block_index;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_OPERATION_STATUS_t status;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);
    user_block_index = (uint32_t)E_EEPROM_XMC1_lGetUsrBlockIndex( block_number);
    block_size = e_eeprom_xmc1_handle->block_config_ptr[user_block_index].size;

    XMC_ASSERT("E_EEPROM_XMC1_ReadBlockWithCRC:Wrong Block Number", (user_block_index  !=
            E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND));
    XMC_ASSERT("E_EEPROM_XMC1_ReadBlockWithCRC:Invalid Buffer Pointer", (data_buffer_ptr != NULL));

    status = E_EEPROM_XMC1_OPERATION_STATUS_NOT_ALLOWED;

    /*Execute only if GC process is in IDLE state */
    if ((data_ptr->gc_state) == E_EEPROM_XMC1_GC_IDLE)
    {
        if (data_ptr->block_info[user_block_index].status.valid == 0U) /* If cache says Inconsistent */
        {
            status = E_EEPROM_XMC1_OPERATION_STATUS_INVALID_BLOCK;
        }
        else if (data_ptr->block_info[user_block_index].status.consistent == 0U) /* If cache says Invalid */
        {
            status = E_EEPROM_XMC1_OPERATION_STATUS_INCONSISTENT_BLOCK;
        }
        else
        {
            data_ptr->read_start_address = data_ptr->block_info[user_block_index].address ;
            /* Call local function to read the specified block of data from flash */
            status = (E_EEPROM_XMC1_OPERATION_STATUS_t)E_EEPROM_XMC1_lReadBlockContents(data_buffer_ptr,
                    block_size , 0U);

            if (status == E_EEPROM_XMC1_OPERATION_STATUS_SUCCESS)
            {
                /* Call local function to cross check the CRC, No ECC check done again for the CRC read function  */
                status = (E_EEPROM_XMC1_OPERATION_STATUS_t)E_EEPROM_XMC1_lReadBlockCrcStatus(block_number, data_buffer_ptr,
                        block_size);
            }
            else
            {
                status = E_EEPROM_XMC1_OPERATION_STATUS_FAILURE;
            }
        }
    }
    return((E_EEPROM_XMC1_OPERATION_STATUS_t)status);
}
#endif

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_GetPreviousData
 ********************************************************************************
 * Summary:
 * This function shall read the just previous copy of the particular block when
 * requested. This function is used commonly when the latest copy gets corrupted.
 *
 * Parameters:
 * block_number   - Number of logical block
 * offset       - Start Location for Read start
 * data_buffer_ptr - Pointer to user data buffer
 * length       - End Location for read completion
 *
 * Return:
 * E_EEPROM_XMC1_STATUS_t
 *
 *******************************************************************************/
E_EEPROM_XMC1_OPERATION_STATUS_t E_EEPROM_XMC1_GetPreviousData(uint8_t block_number,
        uint32_t offset,
        uint8_t *data_buffer_ptr,
        uint32_t length)
{
    uint32_t block_size;
    uint32_t read_start_addr;
    uint32_t user_block_index;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_OPERATION_STATUS_t status;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);
    user_block_index = E_EEPROM_XMC1_lGetUsrBlockIndex(block_number);
    block_size = e_eeprom_xmc1_handle->block_config_ptr[user_block_index].size;

    XMC_ASSERT("E_EEPROM_XMC1_GetPreviousData:Wrong Block Number", (user_block_index  !=
            E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND));
    XMC_ASSERT("E_EEPROM_XMC1_GetPreviousData:Invalid Buffer Pointer", (data_buffer_ptr != NULL));

    /*Execute only if GC process is in IDLE state */
    if ((data_ptr->gc_state == E_EEPROM_XMC1_GC_IDLE) && (((uint32_t)offset + length) <= block_size))
    {

        read_start_addr = E_EEPROM_XMC1_lGetPrevData(block_number);

        if (read_start_addr != 0U )
        {
            data_ptr->read_start_address =  read_start_addr;

            /* Call local function to read the specified block of data from flash */
            status = (E_EEPROM_XMC1_OPERATION_STATUS_t)E_EEPROM_XMC1_lReadBlockContents(data_buffer_ptr, length , offset);
            if ((uint32_t)status != 0U)
            {
                status = E_EEPROM_XMC1_OPERATION_STATUS_FAILURE;
            }
        }
        else
        {
            status = E_EEPROM_XMC1_OPERATION_STATUS_INCONSISTENT_BLOCK;
        }
    }
    else
    {
        status = E_EEPROM_XMC1_OPERATION_STATUS_NOT_ALLOWED;
    }

    return((E_EEPROM_XMC1_OPERATION_STATUS_t)status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lGetPrevData
 ********************************************************************************
 * Summary:
 * This function will traverse through the bank and find the previous copy of
 * the block if existing.
 *
 * Parameters:
 * block_number  - User block number / ID
 *
 * Return:
 * uint32_t - Flash NVM_STATUS register value
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lGetPrevData(uint8_t block_number)
{
    uint32_t block_size;
    uint32_t block_index;
    uint32_t data_sec_start_addr;
    uint32_t expected_block_count;
    uint32_t block_read_start_addr;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

