Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
    /* Get the block details */
    block_index = (uint32_t)E_EEPROM_XMC1_lGetUsrBlockIndex(block_number);
    block_size = e_eeprom_xmc1_handle->block_config_ptr[block_index].size;
    expected_block_count = E_EEPROM_XMC1_lGetDFLASHPhysicalBlocks(block_size);

    /* Find the data bank starting address from current Bank to decide when to stop reading of blocks*/
    if (data_ptr->current_bank == 0U)
    {
        data_sec_start_addr = E_EEPROM_XMC1_FLASH_BANK0_BASE + E_EEPROM_XMC1_DATA_BLOCK_OFFSET;
    }
    else
    {
        data_sec_start_addr = E_EEPROM_XMC1_FLASH_BANK1_BASE + E_EEPROM_XMC1_DATA_BLOCK_OFFSET;
    }

    block_read_start_addr = data_ptr->block_info[block_index].address;

    if (block_read_start_addr >= (data_sec_start_addr + E_EEPROM_XMC1_FLASH_BLOCK_SIZE))
    {
        block_read_start_addr = E_EEPROM_XMC1_lSearchBlockCopy(block_number,
                block_read_start_addr - E_EEPROM_XMC1_FLASH_BLOCK_SIZE,
                data_sec_start_addr);


        if ((block_read_start_addr < data_sec_start_addr) ||
                (data_ptr->block_result.status.consistent != 1U) ||
                (data_ptr->block_result.block_count != expected_block_count) ||
                (data_ptr->block_result.status.valid != 1U))
        {
            block_read_start_addr = 0U;  /* No Previous copy of block exist*/
        }
    }
    else
    {
        block_read_start_addr = 0U;  /* No Previous copy of block can exist*/
    }

    return (block_read_start_addr);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lSearchBlockCopy
 ********************************************************************************
 * Summary:
 * This function reads the block header bytes and compare the block number to
 * find the matching block
 *
 * Parameters:
 * block_number  - User block number / ID
 *
 * Return:
 * uint32_t - Flash NVM_STATUS register value
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lSearchBlockCopy(uint8_t required_block_number,
        uint32_t read_addr,
        uint32_t data_sec_start_addr)
{
    uint32_t header_word;
    uint32_t block_count;
    uint8_t block_status;
    uint8_t read_block_number;
    uint32_t block_start_address;
    uint32_t is_all_blocks_clean;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_BLOCK_HEADER_t* block_header_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    block_count = 0U;
    block_start_address = 0U;
    is_all_blocks_clean = 1U;
    data_ptr->block_result.status.consistent = 0U;
    data_ptr->block_result.status.valid = 0U;
    data_ptr->block_result.block_count = 0U;

    /* Loop until the first block address and check if any block number is matching the required block number*/
    while ((data_sec_start_addr <= read_addr) && (block_start_address == 0U))
    {
        /* Clear all error status flags before flash operation*/
        XMC_FLASH_ClearStatus();

        /* Read the header word */
        header_word = E_EEPROM_XMC1_lReadSingleWord(read_addr);

        block_header_ptr = (E_EEPROM_XMC1_BLOCK_HEADER_t*)(void *)(&header_word);
        read_block_number = block_header_ptr->block_number;
        block_status = block_header_ptr->status;

        /*Check whether the block number is matching the required block number*/
        if (read_block_number == required_block_number)
        {
            block_count++;

            /* Check if any ECC error in the header */
            if ( ( E_EEPROM_XMC1_lGetFlashStatus() & (uint32_t)XMC_FLASH_STATUS_ECC2_READ_ERROR ) != 0U )
            {
                is_all_blocks_clean = 0U;
            }
            /* Check if block header is of the starting block */
            if (block_status & E_EEPROM_XMC1_START_BIT)
            {
                if ( is_all_blocks_clean == 1U )
                {
                    data_ptr->block_result.status.consistent = 1U;
                }

                if (block_status & (uint8_t)E_EEPROM_XMC1_VALID_BIT)
                {
                    data_ptr->block_result.status.valid = 1U;
                }

                data_ptr->block_result.block_count = block_count;
                block_start_address = read_addr;
            }
            else
            {
                read_addr -= E_EEPROM_XMC1_FLASH_BLOCK_SIZE;
            }
        }
        else
        {
            read_addr -= E_EEPROM_XMC1_FLASH_BLOCK_SIZE;
        }
    }
    return(block_start_address);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lInitGc
 ********************************************************************************
 * Summary:
 * his function shall detect if there was any interruption in the ongoing running
 * state (Read/Write/GC). If yes, then this routine shall decide to run a state
 * machine to bring back the emulation to normal state.
 *
 * Parameters:
 * marker_dirty_state  - Dirty state
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lInitGc(const uint32_t marker_dirty_state)
{
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    if ( marker_dirty_state == E_EEPROM_XMC1_BOTH_BANKS_INVALID )  /* If both Bank state markers are in dirty state */
    {
        data_ptr->init_gc_state = E_EEPROM_XMC1_MB_DIRTY;
        E_EEPROM_XMC1_lInitllegalStateMachine();
    }
    else if ( marker_dirty_state == E_EEPROM_XMC1_BANK0_INVALID )  /* If Only Bank0 state marker is in dirty state */
    {
        data_ptr->init_gc_state &= E_EEPROM_XMC1_INIT_STATE_0F;
        data_ptr->init_gc_state |= E_EEPROM_XMC1_INIT_STATE_D0;
        E_EEPROM_XMC1_lInitDirtyStateMachine();
    }
    else if ( marker_dirty_state == E_EEPROM_XMC1_BANK1_INVALID )  /* If Only Bank1 state marker is in dirty state */
    {
        data_ptr->init_gc_state &= E_EEPROM_XMC1_INIT_STATE_F0;
        data_ptr->init_gc_state |= E_EEPROM_XMC1_INIT_STATE_0D;
        E_EEPROM_XMC1_lInitDirtyStateMachine();
    }
    else                                      /* If both Bank state markers have valid state */
    {
        E_EEPROM_XMC1_lInitNormalStateMachine();
    }
}

