Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lInitllegalStateMachine
 ********************************************************************************
 * Summary:
 * This function shall erase all flash and start from fresh depending upon the
 * user configuration
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lInitllegalStateMachine(void)
{
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /*
     * Any state apart from the normal states is considered as Illegal state. Next operation = Start Prepare DFlash
     * (Only if the configuration option Erase all is 1U) IF Configuration Option is 0U, Next Operation = Fail State
     */
    if (e_eeprom_xmc1_handle->erase_all_auto_recovery == 1U)
    {
        /* Change the current Bank to Bank0 */
        data_ptr->current_bank = 0U;
        E_EEPROM_XMC1_lInitGcNormalStates( E_EEPROM_XMC1_PREPFLASH_FF, 1U);
    }
    else
    {
        data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lInitDirtyStateMachine
 ********************************************************************************
 * Summary:
 * This function shall address the dirty state recovery mechanism by erasing and
 * rewriting states
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lInitDirtyStateMachine(void)
{
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);
    switch (data_ptr->init_gc_state)
    {
    case E_EEPROM_XMC1_INIT_STATE_2D:
        /* Change the current Bank to Bank0 and recover from the dirty state to 2E  */
        data_ptr->current_bank = 0U;
        /* Transition states : 2D -> 2F -> 2E */
        E_EEPROM_XMC1_lErasedDirtyStateRecovery( E_EEPROM_XMC1_END_ERASE_OFFSET );
        break;
    case E_EEPROM_XMC1_INIT_STATE_D2:
        /* Change the current Bank to Bank1 and recover from the dirty state to E2 */
        data_ptr->current_bank = 1U;
        /* Transition states : D2 -> F2 -> E2 */
        E_EEPROM_XMC1_lErasedDirtyStateRecovery( E_EEPROM_XMC1_END_ERASE_OFFSET );
        break;
    case E_EEPROM_XMC1_INIT_STATE_AD:
        /* Change the current Bank to Bank0 and recover from the dirty state to 2E */
        data_ptr->current_bank = 0U;
        /* Transition states : AD -> A0 -> GC PROCESS -> 2E */
        E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery( E_EEPROM_XMC1_COPY_COMPLETED ,
                E_EEPROM_XMC1_GC_NEXT_BANK_VALID , 1U);
        break;
    case E_EEPROM_XMC1_INIT_STATE_DA:
        /* Change the current Bank to Bank1  and recover from the dirty state to E2*/
        data_ptr->current_bank = 1U;
        /* Transition states : DA -> 0A -> GC PROCESS -> E2 */
        E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery( E_EEPROM_XMC1_COPY_COMPLETED ,
                E_EEPROM_XMC1_GC_NEXT_BANK_VALID , 1U);
        break;
    case E_EEPROM_XMC1_INIT_STATE_0D:
        /* Change the current Bank to Bank1 and recover from the dirty state to E2 */
        data_ptr->current_bank = 1U;
        /* Transition states : 0D -> 02 -> GC PROCESS -> E2 */
        E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery( E_EEPROM_XMC1_VALID_STATE ,
                E_EEPROM_XMC1_GC_ERASE_PREV_BANK , 0U);
        break;
    case E_EEPROM_XMC1_INIT_STATE_D0:
        /* Change the current Bank to Bank0 and recover from the dirty state to 2E */
        data_ptr->current_bank = 0U;
        /* Transition states : D0 -> 20 -> GC PROCESS -> 2E */
        E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery( E_EEPROM_XMC1_VALID_STATE ,
                E_EEPROM_XMC1_GC_ERASE_PREV_BANK , 0U);
        break;
    default:
        /* Any state apart from the normal states is considered as Illegal state */
        /* Transition states : Illegal -> PREPARE DFLASH -> 2E */
        E_EEPROM_XMC1_lInitllegalStateMachine();
        break;
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lInitNormalStateMachine
 ********************************************************************************
 * Summary:
 * Check which normal bank state machine process has executed.
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lInitNormalStateMachine(void)
{
    /* Check if the state matches with any of the normal marker states with active bank as bank-0*/
    if (E_EEPROM_XMC1_lInitBank0NormalStateMachine() == 0U)
    {
        /* Check if the state matches with any of the normal marker states with active bank as bank-1*/
        if (E_EEPROM_XMC1_lInitBank1NormalStateMachine() == 0U)
        {
            /* Check if the state matches with any other intermediate states from where a recover is possible  */
            if (E_EEPROM_XMC1_lInitOtherNormalStateMachine() == 0U)
            {
                /* If no matches found then go to illegal state and try to recover by erasing complete DFLASH */
                E_EEPROM_XMC1_lInitllegalStateMachine();
            }
        }
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lInitBank0NormalStateMachine
 ********************************************************************************
 * Summary:
 * Execute bank 0 state machine process and return the found states.
 *
 * Parameters:
 * void
 *
 * Return:
 * uint32_t : ( 1= state_found / 0 = State not found )
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lInitBank0NormalStateMachine(void)
{
    uint32_t state_found;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    state_found = 1U;

