Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
    switch (data_ptr->init_gc_state)
    {
    /*
     * Normal Data write in Bank-0 interrupted (2E), Next step = Cache Update and get ready to accept new request
     * Transition states : Nothing
     */
    case E_EEPROM_XMC1_INIT_NORMAL1:
        data_ptr->current_bank = 0U;
        E_EEPROM_XMC1_lInitGcNormalStates( E_EEPROM_XMC1_GC_IDLE, E_EEPROM_XMC1_EXECUTE_CACHE_UPDATE);
        break;

        /*
         * Data copy from Bank0 to Bank1 interrupted (2A), Next step = Erasing Bank-1 and restart copy from Bank-0
         * Transition states : (2A) -> ERASE_BANK0 (2F) -> 2E -> GC_PROCESS (2A -> 0A -> 20 -> F2 -> E2)
         */
    case E_EEPROM_XMC1_INIT_DATA_COPY1:
        data_ptr->current_bank = 0U;
        E_EEPROM_XMC1_lInitGcDataCopyState( E_EEPROM_XMC1_GC_REQUESTED, E_EEPROM_XMC1_END_ERASE_OFFSET);
        break;

        /*
         * Interrupted after copy completion from Bank1 to Bank0 (A0),Next step = Writing Valid state into Bank-0
         * Transition states : (A0) -> (20) -> GC_PROCESS (2F -> 2E)
         */
    case E_EEPROM_XMC1_INIT_COPY_DONE1:
        data_ptr->current_bank = 0U;
        E_EEPROM_XMC1_lInitGcNormalStates( E_EEPROM_XMC1_GC_NEXT_BANK_VALID, E_EEPROM_XMC1_EXECUTE_GC_STATE);
        break;

        /*
         * Interrupted after writing valid state to Bank0 (20), Next step = Erase of old redundant Bank-1 (2F)
         * Transition states : (20) -> (2F) -> GC_PROCESS (2E)
         */
    case E_EEPROM_XMC1_INIT_NEXT_VALID1:
        data_ptr->current_bank = 0U;
        E_EEPROM_XMC1_lInitGcNormalStates( E_EEPROM_XMC1_GC_ERASE_PREV_BANK, E_EEPROM_XMC1_EXECUTE_GC_STATE);
        break;

        /*
         * Interrupted after erase of old bank completed(2F), Next step = Mark erased Bank-1 with Formatted state(2E)
         * Transition states : (2F) -> GC_PROCESS (2E)
         */
    case E_EEPROM_XMC1_INIT_END_ERASE1:
        data_ptr->current_bank = 0U;
        E_EEPROM_XMC1_lInitGcNormalStates( E_EEPROM_XMC1_GC_MARK_END_ERASE1, E_EEPROM_XMC1_EXECUTE_GC_STATE);
        break;

    default:
        state_found = 0U;
        break;
    }
    return (state_found);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lInitBank1NormalStateMachine
 ********************************************************************************
 * Summary:
 * Execute bank 1 state machine process and return the found states.
 *
 * Parameters:
 * uint32_t : ( 1= state_found / 0 = State not found )
 *
 * Return:
 * E_EEPROM_XMC1_STATUS_t
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lInitBank1NormalStateMachine(void)
{
    uint32_t state_found;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    state_found = 1U;

    switch (data_ptr->init_gc_state)
    {
    /*
     * Normal Data write in Bank-1 interrupted (E2), Next step = Cache Update and get ready to accept new request
     * Transition states : Nothing
     */
    case E_EEPROM_XMC1_INIT_NORMAL2:
        data_ptr->current_bank = 1U;
        E_EEPROM_XMC1_lInitGcNormalStates( E_EEPROM_XMC1_GC_IDLE, E_EEPROM_XMC1_EXECUTE_CACHE_UPDATE);
        break;

        /*
         * Data copy from Bank1 to Bank0 interrupted (A2), Next step = Erasing Bank-0 and restart copy from Bank-1
         * Transition states : (A2) -> ERASE_BANK0 (F2) -> E2 -> GC_PROCESS (A2 -> A0 -> 20 -> 2F -> 2E)
         */
    case E_EEPROM_XMC1_INIT_DATA_COPY2:
        data_ptr->current_bank = 1U;
        E_EEPROM_XMC1_lInitGcDataCopyState( E_EEPROM_XMC1_GC_REQUESTED, E_EEPROM_XMC1_END_ERASE_OFFSET);
        break;

        /*
         * Interrupted after copy completion from Bank0 to Bank1 (0A),Next step = Writing Valid state into Bank-1
         * Transition states : (0A) -> (02) -> GC_PROCESS (F2 -> E2)
         */
    case E_EEPROM_XMC1_INIT_COPY_DONE2:
        data_ptr->current_bank = 1U;
        E_EEPROM_XMC1_lInitGcNormalStates( E_EEPROM_XMC1_GC_NEXT_BANK_VALID, E_EEPROM_XMC1_EXECUTE_GC_STATE);
        break;

        /*
         * Interrupted after writing valid state to Bank1 (02), Next step = Erase of old redundant Bank-0 (F2)
         * Transition states : (02) -> (F2) -> GC_PROCESS (E2)
         */
    case E_EEPROM_XMC1_INIT_NEXT_VALID2:
        data_ptr->current_bank = 1U;
        E_EEPROM_XMC1_lInitGcNormalStates( E_EEPROM_XMC1_GC_ERASE_PREV_BANK, E_EEPROM_XMC1_EXECUTE_GC_STATE);
        break;

        /*
         * Interrupted after erase of old bank completed(F2), Next step = Mark erased Bank-0 with Formatted state(E2)
         * Transition states : (F2) -> GC_PROCESS (E2)
         */
    case E_EEPROM_XMC1_INIT_END_ERASE2:
        data_ptr->current_bank = 1U;
        E_EEPROM_XMC1_lInitGcNormalStates( E_EEPROM_XMC1_GC_MARK_END_ERASE1, E_EEPROM_XMC1_EXECUTE_GC_STATE);
        break;

    default:
        state_found = 0U;
        break;
    }
    return (state_found);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lInitOtherNormalStateMachine
 ********************************************************************************
 * Summary:
 * Execute other state machine process and return the found states.
 *
 * Parameters:
 * void
 *
 * Return:
 * uint32_t : ( 1= state_found / 0 = State not found )
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lInitOtherNormalStateMachine(void)
{
    uint32_t state_found;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    state_found = 1U;

    switch (data_ptr->init_gc_state)
    {
    /* Interrupted after erase of both banks completed (FF), Next step = Start Prepare DFlash  */
    case E_EEPROM_XMC1_INIT_ALL_ERASED:
        /* Change the current Bank to Bank0 */
        data_ptr->current_bank = 0U;
        /* Transition states : FF ->  PREPARE_DFLASH (2F) -> 2E */
        E_EEPROM_XMC1_lInitGcNormalStates( E_EEPROM_XMC1_PREPFLASH_FF, E_EEPROM_XMC1_EXECUTE_PREP_FLASH);
        break;

