Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
        /*
         * Interrupted after erase of Bank1 during previous recovery(AF), Next step = Bank0 marker Page program (A0)
         * Transition states : AF -> A0 -> GC PROCESS -> 20 -> 2F -> 2E
         */
    case E_EEPROM_XMC1_INIT_STATE_AF:
        /* Change the current Bank to Bank1 */
        data_ptr->current_bank = 0U;

        E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery( E_EEPROM_XMC1_COPY_COMPLETED ,
                E_EEPROM_XMC1_GC_NEXT_BANK_VALID , 1U);
        break;

        /*
         * Interrupted after erase of Bank0 during previous recovery(FA), Next step = Bank1 marker Page program (0A)
         * Transition states : FA -> 0A -> GC PROCESS -> 02 -> F2 -> E2
         */
    case E_EEPROM_XMC1_INIT_STATE_FA:
        data_ptr->current_bank = 1U;
        E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery( E_EEPROM_XMC1_COPY_COMPLETED ,
                E_EEPROM_XMC1_GC_NEXT_BANK_VALID , 1U);
        break;

        /*
         * Interrupted after erase of Bank1 during previous recover(0F), Next step = Bank1 marker Page program (02)
         * Transition states : 0F -> 02 -> GC PROCESS -> F2 -> E2
         */
    case E_EEPROM_XMC1_INIT_STATE_0F:
        data_ptr->current_bank = 1U;
        E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery( E_EEPROM_XMC1_VALID_STATE ,
                E_EEPROM_XMC1_GC_ERASE_PREV_BANK , 0U);
        break;

        /*
         * Interrupted after erase of Bank1 during previous recover(F0), Next step = Bank1 marker Page program (20)
         * Transition states : F0 -> 20 -> GC PROCESS -> 2F -> 2E
         */
    case E_EEPROM_XMC1_INIT_STATE_F0:
        /* Change the current Bank to Bank0 */
        data_ptr->current_bank = 0U;
        /* Transition states : D0 -> 20 -> GC PROCESS -> 2E */
        E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery( E_EEPROM_XMC1_VALID_STATE ,
                E_EEPROM_XMC1_GC_ERASE_PREV_BANK , 0U);
        break;

    default:
        state_found = 0U;
        break;
    }
    return (state_found);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lInitGcNormalStates
 ********************************************************************************
 * Summary:
 * Executes normal Garbage collection state machine sub process
 *
 * Parameters:
 * current_state  - Current GC state
 * next_process  - Number of logical block
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lInitGcNormalStates(uint32_t current_state, uint32_t next_process)
{
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /* Update the Bank related global variables */
    E_EEPROM_XMC1_lUpdateCurrBankInfo();

    if (next_process == E_EEPROM_XMC1_EXECUTE_PREP_FLASH)
    {
        /* Update the GC state*/
        data_ptr->gc_state = current_state;
        /* Start Prepare DFlash routine to build FEE base  */
        E_EEPROM_XMC1_lPrepareDFlash();
        /* Update the RAM Cache Table */
        E_EEPROM_XMC1_lUpdateCache();
    }
    else if (next_process == E_EEPROM_XMC1_EXECUTE_GC_STATE)
    {
        /* Update the GC state */
        data_ptr->gc_state = current_state;
        /* Update the RAM Cache Table */
        E_EEPROM_XMC1_lUpdateCache();
        /* Start Garbage Collection */
        E_EEPROM_XMC1_lGarbageCollection();
    }
    else /* if ( next_process == E_EEPROM_XMC1_EXECUTE_CACHE_UPDATE ) */
    {
        /* Update the RAM Cache Table */
        E_EEPROM_XMC1_lUpdateCache();
        /* Update the GC state as Bank-0 Erase Completed state */
        data_ptr->gc_state = current_state;
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lInitGcDataCopyState
 ********************************************************************************
 * Summary:
 * Executes data copy state GC state machine sub process.
 *
 * Parameters:
 * current_state  - Current GC state
 * marker_offset  - Marker block offset
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lInitGcDataCopyState(uint32_t current_state, uint32_t marker_offset)
{
    uint32_t status;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /* Update the Bank related global variables */
    E_EEPROM_XMC1_lUpdateCurrBankInfo();

    /* Update the GC state as restart copy process */
    data_ptr->gc_state = current_state ;

    /* Update the RAM Cache Table with */
    E_EEPROM_XMC1_lUpdateCache();

    /* Erase the previous redundant bank */
    status = E_EEPROM_XMC1_lEraseBank(data_ptr->prev_bank_end_addr);

    if (status == 0U)
    {
        E_EEPROM_XMC1_lSetMarkerBlockBuffer();

        /* Write formatted state to the erased bank (2E)  */
        status = E_EEPROM_XMC1_lGCWrite((uint32_t)(data_ptr->gc_dest_addr + marker_offset));

        if (status == 0U)
        {
            /* Start Garbage Collection */
            E_EEPROM_XMC1_lGarbageCollection();
        }
        else
        {
            data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
        }

    }
    else
    {
        data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
    }

}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lErasedDirtyStateRecovery
 ********************************************************************************
 * Summary:
 * Executes state machine sub process for erase dirty states to recover.
 *
 * Parameters:
 * marker_offset  - Marker block offset
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lErasedDirtyStateRecovery( uint32_t marker_offset)
{
    uint32_t  status;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /* Update the Bank related global variables */
    E_EEPROM_XMC1_lUpdateCurrBankInfo();

    /* Erase the previous redundant bank */
    status = E_EEPROM_XMC1_lEraseBank(data_ptr->prev_bank_end_addr);

