Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
    if (status == 0U)
    {
        E_EEPROM_XMC1_lSetMarkerBlockBuffer();

        /* Write formatted state to the erased bank */
        status = E_EEPROM_XMC1_lGCWrite((uint32_t)(data_ptr->gc_dest_addr + marker_offset));
        if (status == 0U)
        {
            /* Update the RAM Cache Table with the written blocks of data.*/
            E_EEPROM_XMC1_lUpdateCache();

            data_ptr->gc_state = E_EEPROM_XMC1_GC_IDLE;
        }
        else
        {
            data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
        }
    }
    else
    {
        data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery
 ********************************************************************************
 * Summary:
 * Recovers from any copy process dirty state.
 *
 * Parameters:
 * current_state   - Current GC state
 * NextState      - Next GC state
 * page_addr_select - Page address from which bank to be written
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lCopyProcessDirtyStateRecovery( uint32_t current_state,
        uint32_t next_state,
        uint32_t page_addr_select)
{
    uint32_t  status;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /* Update the Bank related global variables */
    E_EEPROM_XMC1_lUpdateCurrBankInfo();

    /* Set the marker blocks with copy completed state */
    E_EEPROM_XMC1_lSetMarkerPageBuffer(current_state);

    /* Clear all error status flags before flash operation*/
    XMC_FLASH_ClearStatus();

    /* Decide the bank from page_addr_select and Erase the marker page + Program with the current state + Verify */
    if (page_addr_select == 1U)
    {
        E_EEPROM_XMC1_lWriteSinglePage(data_ptr->gc_dest_addr, (uint32_t*)(void*)data_ptr->page_write_buffer);
    }
    else
    {
        E_EEPROM_XMC1_lWriteSinglePage(data_ptr->gc_src_addr, (uint32_t*)(void*)data_ptr->page_write_buffer);
    }

    status = E_EEPROM_XMC1_lGetFlashStatus();

    if (status == 0U)
    {
        /* Update the GC state as write next bank valid */
        data_ptr->gc_state = next_state ;
        /* Update the RAM Cache Table */
        E_EEPROM_XMC1_lUpdateCache();
        /* Start Garbage Collection */
        E_EEPROM_XMC1_lGarbageCollection();
    }
    else
    {
        data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lGarbageCollection
 ********************************************************************************
 * Summary:
 * This function execute's the garbage collection state machine.
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lGarbageCollection(void)
{
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    do
    {
        switch (data_ptr->gc_state)
        {
        case E_EEPROM_XMC1_GC_COPY_START:
            E_EEPROM_XMC1_lHandleGcStartCopy();
            break;

        case E_EEPROM_XMC1_GC_COPY_WRITE:
            E_EEPROM_XMC1_lHandleGcCopyWrite();
            break;

        case E_EEPROM_XMC1_GC_READ_NXTBLOCK:
            XMC_FLASH_ClearStatus();
            E_EEPROM_XMC1_lReadSingleBlock(data_ptr->gc_src_addr ,(uint32_t*)(void*)data_ptr->read_write_buffer);
            data_ptr->gc_state = E_EEPROM_XMC1_GC_COPY_WRITE;
            break;

        case E_EEPROM_XMC1_GC_COPY_END:
            E_EEPROM_XMC1_lHandleGcEndOfCopy();
            break;

        case E_EEPROM_XMC1_GC_NEXT_BANK_VALID:
            E_EEPROM_XMC1_lHandleGcOtherStates(E_EEPROM_XMC1_GC_NEXT_BANK_VALID, E_EEPROM_XMC1_GC_ERASE_PREV_BANK);
            break;

        case E_EEPROM_XMC1_GC_ERASE_PREV_BANK:
            E_EEPROM_XMC1_lHandleGcOtherStates( E_EEPROM_XMC1_GC_ERASE_PREV_BANK, E_EEPROM_XMC1_GC_MARK_END_ERASE1);
            break;

        case E_EEPROM_XMC1_GC_MARK_END_ERASE1:
            E_EEPROM_XMC1_lHandleGcOtherStates(E_EEPROM_XMC1_GC_MARK_END_ERASE1, E_EEPROM_XMC1_GC_IDLE);
            break;

        default:
            E_EEPROM_XMC1_lHandleGcRequested(); /* E_EEPROM_XMC1_GC_REQUESTED state*/
            break;
        }

    } while ((data_ptr->gc_state != E_EEPROM_XMC1_GC_IDLE) &&
            (data_ptr->gc_state != E_EEPROM_XMC1_GC_FAIL));
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lHandleGcRequested
 ********************************************************************************
 * Summary:
 * This function handles Garbage Collection GC REQUESTED state
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lHandleGcRequested(void)
{
    uint32_t status;
    uint32_t block_count;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_CACHE_t *cache_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    E_EEPROM_XMC1_lSetMarkerBlockBuffer();
    /* Write Copy start state to new bank  (2A) or (A2) */
    status = E_EEPROM_XMC1_lGCWrite((uint32_t)(data_ptr->gc_dest_addr + E_EEPROM_XMC1_BEGIN_OFFSET));
    if (status == 0U)
    {
        /* Initialize the copied status for all the logical blocks */
        cache_ptr = data_ptr->block_info;
        block_count = 0U;
        do
        {
            cache_ptr->status.copied = 0U;
            block_count++;
            cache_ptr++;
        } while (block_count != e_eeprom_xmc1_handle->block_count);

        data_ptr->gc_log_block_count = 0U;
        data_ptr->gc_state = E_EEPROM_XMC1_GC_COPY_START;
        data_ptr->gc_dest_addr = data_ptr->gc_dest_addr + E_EEPROM_XMC1_DATA_BLOCK_OFFSET;
    }
    else
    {
        data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
    }
}

