Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lHandleGcStartCopy
 ********************************************************************************
 * Summary:
 * This function handles Garbage Collection GC START COPY state
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lHandleGcStartCopy(void)
{
    uint32_t state_flag;
    uint32_t block_count;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_CACHE_t *cache_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    state_flag = 0U;
    /* initialize the copied status for all the logical blocks */
    block_count = data_ptr->gc_log_block_count;
    cache_ptr = data_ptr->block_info + block_count;
    /*
     * Check all available blocks in cache table for Copy process. Condition breaks on either the current block is
     * consistent or all blocks check for consistency is finished
     */
    while ((state_flag == 0U) && (block_count != e_eeprom_xmc1_handle->block_count))
    {
        /* If block is consistent set state flag for copy enable*/
        if (((cache_ptr->address != 0U) && (cache_ptr->status.consistent == 1U)) && (cache_ptr->status.copied == 0U))
        {
            state_flag = 1U;
        }
        /* If block is inconsistent ignore the block from copy and try next block*/
        else
        {
            block_count++;
            cache_ptr++;
        }
    } /* end of while */

    /* If block is consistent */
    if (state_flag == 1U)
    {
        data_ptr->gc_src_addr = cache_ptr->address;
        data_ptr->gc_block_counter = 0U;

        /* Clear all error status flags before flash operation*/
        XMC_FLASH_ClearStatus();

        E_EEPROM_XMC1_lReadSingleBlock(data_ptr->gc_src_addr,(uint32_t*)(void*)data_ptr->read_write_buffer);

        /* Return value above is ignored as parameters passed from FEE are correct */
        data_ptr->gc_state = E_EEPROM_XMC1_GC_COPY_WRITE;
    }
    /* Finished copying all the logical blocks */
    else
    {
        /* Update the next free block pointer */
        data_ptr->next_free_block_addr = data_ptr->gc_dest_addr;
        data_ptr->gc_src_addr = data_ptr->curr_bank_src_addr;
        E_EEPROM_XMC1_lUpdateCurrBankInfo();
        data_ptr->gc_state = E_EEPROM_XMC1_GC_COPY_END;
    }
    data_ptr->gc_log_block_count = block_count;
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lHandleGcCopyWrite
 ********************************************************************************
 * Summary:
 * This function handles Garbage Collection GC START COPY WRITE state.
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lHandleGcCopyWrite(void)
{
    uint32_t size;
    uint32_t status;
    uint32_t block_count;
    uint32_t flash_physical_blocks;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_CACHE_t *cache_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /* initialize the copied status for all the logical blocks */
    block_count = data_ptr->gc_log_block_count;
    cache_ptr = data_ptr->block_info + block_count;

    status = E_EEPROM_XMC1_lGCWrite((uint32_t)(data_ptr->gc_dest_addr));
    if (status == 0U)
    {
        (data_ptr->gc_block_counter)++;
        size = (e_eeprom_xmc1_handle->block_config_ptr[block_count].size);
        flash_physical_blocks = E_EEPROM_XMC1_lGetDFLASHPhysicalBlocks(size);
        /* If all the blocks of the logical block are copied */
        if ((data_ptr->gc_block_counter == flash_physical_blocks) || (cache_ptr->status.valid == 0U))
        {
            cache_ptr->status.copied = 1U;
            block_count++;
            data_ptr->gc_state = E_EEPROM_XMC1_GC_COPY_START;
            data_ptr->gc_dest_addr += E_EEPROM_XMC1_FLASH_BLOCK_SIZE;
            cache_ptr->address = data_ptr->gc_dest_addr - (E_EEPROM_XMC1_FLASH_BLOCK_SIZE * data_ptr->gc_block_counter);
        }
        else
        {
            data_ptr->gc_src_addr = data_ptr->gc_src_addr + E_EEPROM_XMC1_FLASH_BLOCK_SIZE;
            data_ptr->gc_dest_addr = data_ptr->gc_dest_addr + E_EEPROM_XMC1_FLASH_BLOCK_SIZE;
            data_ptr->gc_state = E_EEPROM_XMC1_GC_READ_NXTBLOCK;
        }
    }
    else
    {
        data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
    }
    data_ptr->gc_log_block_count = block_count;
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lHandleGcEndOfCopy
 ********************************************************************************
 * Summary:
 * This function handles Garbage Collection GC END OF COPY state
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lHandleGcEndOfCopy(void)
{
    uint32_t  status;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    E_EEPROM_XMC1_lSetMarkerBlockBuffer();
    /* Write Copy completed state to old bank (0A) or (A0) */
    status = E_EEPROM_XMC1_lGCWrite((uint32_t)(data_ptr->gc_src_addr + E_EEPROM_XMC1_END_OF_COPY_OFFSET));
    if (status == 0U)
    {
        /* Update the current bank to next bank */
        data_ptr->current_bank = data_ptr->current_bank ^ 1U;

        /* Update the Bank related global variables */
        E_EEPROM_XMC1_lUpdateCurrBankInfo();
        data_ptr->gc_state = E_EEPROM_XMC1_GC_NEXT_BANK_VALID;
    }
    else
    {
        data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lHandleGcOtherStates
 ********************************************************************************
 * Summary:
 * This function handles Garbage Collection GC NEXT BANk VALID, ERASE PREV BANK
 * and GC COMPLETED IDLE state
 *
 * Parameters:
 * current_state - current state machine status
 * next_state - next state of the state machine
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lHandleGcOtherStates( uint32_t current_state, uint32_t next_state)
{
    uint32_t  status;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    if (current_state == E_EEPROM_XMC1_GC_NEXT_BANK_VALID)
    {
        E_EEPROM_XMC1_lSetMarkerBlockBuffer();
        /* Write next bank to valid state  (02) or (20) */
        status = E_EEPROM_XMC1_lGCWrite((uint32_t)(data_ptr->gc_src_addr + E_EEPROM_XMC1_NEXT_VALID_OFFSET));
    }
    else if (current_state == E_EEPROM_XMC1_GC_ERASE_PREV_BANK)
    {
        /* Erase the previous redundant bank (F2) or (2F) */
        status = E_EEPROM_XMC1_lEraseBank(data_ptr->prev_bank_end_addr);
    }
    else
    {
        E_EEPROM_XMC1_lSetMarkerBlockBuffer();
        /* Write formatted state to the old erased bank (E2) or (2E) */
        status = E_EEPROM_XMC1_lGCWrite((uint32_t)(data_ptr->gc_dest_addr + E_EEPROM_XMC1_END_ERASE_OFFSET));
    }

