Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
    if (status == 0U)
    {
        data_ptr->gc_state = next_state;
    }
    else
    {
        data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lPrepareDFlash
 ********************************************************************************
 * Summary:
 * This function executes the prepare data flash to bring the state machine to
 * default state (2E).
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lPrepareDFlash(void)
{
    uint32_t status;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    do
    {
        switch (data_ptr->gc_state)
        {
        case E_EEPROM_XMC1_PREPFLASH_2F:

            /* Set the marker blocks with copy completed state */
            E_EEPROM_XMC1_lSetMarkerPageBuffer(E_EEPROM_XMC1_VALID_STATE);

            /* Clear all error status flags before flash operation*/
            XMC_FLASH_ClearStatus();

            E_EEPROM_XMC1_lWriteSinglePage(E_EEPROM_XMC1_FLASH_BANK0_BASE , (uint32_t*)(void*)data_ptr->page_write_buffer);

            status = E_EEPROM_XMC1_lGetFlashStatus();

            if (status == 0U)
            {
                data_ptr->gc_state = E_EEPROM_XMC1_PREPFLASH_2E;
            }
            else
            {
                data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
            }
            break;

        case E_EEPROM_XMC1_PREPFLASH_2E:

            E_EEPROM_XMC1_lSetMarkerBlockBuffer();

            /* Write Bank1 to formatted state  (2E) */
            status = E_EEPROM_XMC1_lGCWrite((uint32_t)E_EEPROM_XMC1_FLASH_BANK1_BASE + E_EEPROM_XMC1_END_ERASE_OFFSET);

            if (status == 0U)
            {
                data_ptr->gc_state = E_EEPROM_XMC1_GC_IDLE;
            }
            else
            {
                data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
            }
            break;

        default:  /* gc_state : E_EEPROM_XMC1_PREPFLASH_FF*/

            /* Erase the previous redundant bank */
            status = E_EEPROM_XMC1_lEraseBank(data_ptr->curr_bank_end_addr);

            /* Erase the previous redundant bank */
            if (status == 0U)
            {
                status = E_EEPROM_XMC1_lEraseBank(data_ptr->prev_bank_end_addr);

                if (status == 0U)
                {
                    data_ptr->gc_state = E_EEPROM_XMC1_PREPFLASH_2F;
                }
                else
                {
                    data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
                }
            }
            else
            {
                data_ptr->gc_state = E_EEPROM_XMC1_GC_FAIL;
            }
            break;
        }
    } while ((data_ptr->gc_state != E_EEPROM_XMC1_GC_IDLE) &&
            (data_ptr->gc_state != E_EEPROM_XMC1_GC_FAIL));
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lUpdateCache
 ********************************************************************************
 * Summary:
 * This utility function update's the cache table which contains the latest
 * information about the FLASH contents.
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lUpdateCache(void)
{
    uint32_t end_addr;
    uint32_t read_status;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_CACHE_t *cache_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /* Evaluate the end address of the bank to start reading blocks for cache update */
    if (data_ptr->current_bank == 0U)
    {
        end_addr = E_EEPROM_XMC1_FLASH_BANK0_BASE + E_EEPROM_XMC1_DATA_BLOCK_OFFSET;
    }
    else
    {
        end_addr = E_EEPROM_XMC1_FLASH_BANK1_BASE + E_EEPROM_XMC1_DATA_BLOCK_OFFSET;
    }

    /* Reset the read number of blocks count variable and reset cache update index */
    data_ptr->written_block_counter = 0U;
    data_ptr->updated_cache_index = E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND;

    /* Start the Cache Update state machine */
    data_ptr->cache_state = E_EEPROM_XMC1_CACHE_EMPTY_BLOCK;

    /* Point to starting address of last data block of the bank */
    data_ptr->curr_bank_src_addr += ( E_EEPROM_XMC1_FLASH_BANK_SIZE - E_EEPROM_XMC1_FLASH_BLOCK_SIZE);
    /* Search for the first entry of a non empty block inside the valid bank starting from bottom */
    do{
        read_status = E_EEPROM_XMC1_lCacheEmptyBlkEval(end_addr);
    } while (data_ptr->cache_state == E_EEPROM_XMC1_CACHE_EMPTY_BLOCK);

    /* Update the next free block location only if it is not done by the previous function call  */
    if (data_ptr->next_free_block_addr == 0U)
    {
        data_ptr->next_free_block_addr = (data_ptr->curr_bank_src_addr) + E_EEPROM_XMC1_FLASH_BLOCK_SIZE;
    }

    /* Execute the Cache update state machine until the Start address of bank is reached traversing from end of bank */
    while (data_ptr->cache_state != E_EEPROM_XMC1_CACHE_UPDATE_DONE)
    {
        /* Check If the previous read had an ECC error or not */
        if (!(read_status & (uint32_t)XMC_FLASH_STATUS_ECC2_READ_ERROR))
        {
            /* Evaluate the Block status since no error found */
            E_EEPROM_XMC1_lEvalBlockStatus();
        }
        else
        {
            /* If previous read block of the block had correct block number then mark the block as inconsistent */
            if ( data_ptr->updated_cache_index != E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND )
            {
                /* Goto the cache table entry for the given block */
                cache_ptr = data_ptr->block_info;
                cache_ptr = cache_ptr + data_ptr->updated_cache_index;
                /* Since CacheUpdateIndex contains valid block the  previous read block must belong to this block */
                cache_ptr->address = E_EEPROM_XMC1_ALL_ONES;
            }
            /* Prepare for the next block */
            data_ptr->updated_cache_index = E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND;
            data_ptr->written_block_counter = 0U;
        }
        /* Check if all blocks have been read */
        if ( data_ptr->curr_bank_src_addr == end_addr )
        {
            /* Goto the next state */
            data_ptr->cache_state = E_EEPROM_XMC1_CACHE_UPDATE_DONE;
        }
        else
        {
            read_status = E_EEPROM_XMC1_lUpdateCacheBlockRead();
        }
    }
}

