Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lCacheEmptyBlkEval
 ********************************************************************************
 * Summary:
 * This utility function  will search through the FLASH from the bottom of the
 * bank until a readable data block is found.
 *
 * Parameters:
 * end_addr - Last address to stop reading the block data
 *
 * Return:
 * uint32_t
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lCacheEmptyBlkEval(uint32_t end_addr)
{
    uint32_t status;
    uint32_t *read_word_ptr;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    XMC_FLASH_ClearStatus();

    /* Read the complete block */
    E_EEPROM_XMC1_lReadSingleBlock(data_ptr->curr_bank_src_addr, (uint32_t*)(void*)data_ptr->read_write_buffer);

    status = E_EEPROM_XMC1_lGetFlashStatus();

    /* If ECC error exists because of any previous interruptions or power failures during Flash operation in progress*/
    if (status & (uint32_t)XMC_FLASH_STATUS_ECC2_READ_ERROR)
    {
        /* Update the free block location of the valid bank once and for ever until new write happens*/
        if (data_ptr->next_free_block_addr == 0U)
        {
            data_ptr->next_free_block_addr = (data_ptr->curr_bank_src_addr + E_EEPROM_XMC1_FLASH_BLOCK_SIZE );
        }

        /* Check if all blocks have been read? If yes go to cache update complete state else move to the next block */
        if ( data_ptr->curr_bank_src_addr == end_addr )
        {
            data_ptr->cache_state = E_EEPROM_XMC1_CACHE_UPDATE_DONE;
        }
        else
        {
            data_ptr->curr_bank_src_addr -= E_EEPROM_XMC1_FLASH_BLOCK_SIZE;
        }
    }
    /* No ECC Error */
    else
    {
        read_word_ptr = ((uint32_t*)(void*)data_ptr->read_write_buffer);
        /* Check if the first word of the block is having some data written on it */
        if (*read_word_ptr != E_EEPROM_XMC1_ALL_ONES)
        {
            /* Increment the data block count and go to the next block read state */
            data_ptr->written_block_counter = data_ptr->written_block_counter + 1U;
            data_ptr->cache_state = E_EEPROM_XMC1_CACHE_NEXT_BLK;
        }
        else
        {
            /* Check if all blocks have been read? If yes go to cache update complete state else move to next block */
            if ( data_ptr->curr_bank_src_addr == end_addr )
            {
                data_ptr->cache_state = E_EEPROM_XMC1_CACHE_UPDATE_DONE;
            }
            data_ptr->curr_bank_src_addr -= E_EEPROM_XMC1_FLASH_BLOCK_SIZE;
        }
    }
    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lEvalBlockStatus
 ********************************************************************************
 * Summary:
 * This function evaluates the block status and updates the cache (if required).
 *                    Entry Criteria:
 *                    1) No ECC error
 *                    2) Block number is non zero
 *                    Possible results:
 *                    1) cache updated: consistent
 *                    2) cache updated: inconsistent
 *                    3) cache already updated (no actions done)
 *                    4) cannot evaluate - requires more blocks to be read
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lEvalBlockStatus(void)
{
    uint32_t size;
    uint32_t indx;
    uint32_t status_byte;
    uint8_t  block_number;
    uint32_t physical_blocks;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_CACHE_t *cache_ptr;
    E_EEPROM_XMC1_BLOCK_HEADER_t *Ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);
    Ptr = (E_EEPROM_XMC1_BLOCK_HEADER_t *)(void *)data_ptr->read_write_buffer;
    block_number = Ptr->block_number;
    status_byte = Ptr->status;

    cache_ptr = data_ptr->block_info;

    /* Get the Index of the read block from the user configuration */
    indx = E_EEPROM_XMC1_lGetUsrBlockIndex(block_number);

    /* If the block is found */
    if ( (indx != E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND) )
    {
        /* Point to the cache table entry for the block to be evaluated */
        cache_ptr = cache_ptr + indx;

        /* Store Index of current block */
        data_ptr->updated_cache_index = indx;

        /* Check if cache table is updated for the given block : address = 0U => cache table not yet updated */
        if (cache_ptr->address == 0U)
        {
            /* If the starting block of the block found */
            if ((status_byte & E_EEPROM_XMC1_START_BIT ) != 0U)
            {
                /* Update the cache with block address */
                cache_ptr->address = data_ptr->curr_bank_src_addr;

                /* if the Valid bit for the logical block is set */
                if ((status_byte & (E_EEPROM_XMC1_VALID_BIT) ) != 0U)
                {
                    cache_ptr->status.valid = 1U;

                    /* if the CRC bit for the logical block is set */
                    if ((status_byte & (E_EEPROM_XMC1_CRC_BIT) ) != 0U)
                    {
                        cache_ptr->status.crc = 1U;
                    }
                    else
                    {
                        cache_ptr->status.crc = 0U;
                    }
                }
                else
                {
                    cache_ptr->status.valid = 0U;
                }

                /* Check If number of Flash blocks used for this data block is same in size */
                size = (uint32_t)(e_eeprom_xmc1_handle->block_config_ptr[indx].size);
                physical_blocks = E_EEPROM_XMC1_lGetDFLASHPhysicalBlocks(size);

                if ( data_ptr->written_block_counter == physical_blocks)
                {
                    cache_ptr->status.consistent = 1U;  /* EVALUATION RESULT : BLOCK CONSISTENT*/
                }
                else
                {
                    if (cache_ptr->status.valid == 1U)
                    {
                        cache_ptr->status.consistent = 0U;  /* EVALUATION RESULT : BLOCK INCONSISTENT */
                    }
                    else
                    {
                        cache_ptr->status.consistent = 1U; /* If the block is invalid, then mark : BLOCK INCONSISTENT */
                    }
                }
                /* Initialize the Index, block block count for the next read */
                data_ptr->updated_cache_index = E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND;
                data_ptr->written_block_counter = 0U;
            }

