Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
        }
        else
        {
            /*
             * EVALUATION RESULT : CACHE ALREADY UPDATED
             * If cache table is already updated for the block, no need to evaluate the block
             */
            data_ptr->updated_cache_index = E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND;
            data_ptr->written_block_counter = 0U;
        }
    }
    else
    {
        data_ptr->updated_cache_index = E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND;
        data_ptr->written_block_counter = 0U;
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lUpdateCacheBlockRead
 ********************************************************************************
 * Summary:
 * Utility function to read data block from flash for cache update function.
 *
 * Parameters:
 * void
 *
 * Return:
 * uint32_t
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lUpdateCacheBlockRead(void)
{
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /* Set the Write Source pointer to the next block */
    data_ptr->curr_bank_src_addr = data_ptr->curr_bank_src_addr -  E_EEPROM_XMC1_FLASH_BLOCK_SIZE;

    /* Clear all error status flags before flash operation*/
    XMC_FLASH_ClearStatus();

    E_EEPROM_XMC1_lReadSingleBlock(data_ptr->curr_bank_src_addr,  (uint32_t*)(void*)data_ptr->read_write_buffer);

    /* Increment number of read block counter  */
    data_ptr->written_block_counter = data_ptr->written_block_counter + 1U;

    return (E_EEPROM_XMC1_lGetFlashStatus());
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lGetUsrBlockIndex
 ********************************************************************************
 * Summary:
 * This utility function will return the Index (location) of the block in the
 * user configuration.
 *
 * Parameters:
 * block_number  - User data block number / ID
 *
 * Return:
 * uint32_t : returns array index pointer of block configuration
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lGetUsrBlockIndex(uint8_t block_number)
{
    uint32_t indx;
    E_EEPROM_XMC1_BLOCK_t  *block_ptr;

    indx = 0U;
    block_ptr = &(e_eeprom_xmc1_handle->block_config_ptr[indx]);

    /* Check for max configured block count reached and block number is matched against the configured block numbers */
    while ( (indx < e_eeprom_xmc1_handle->block_count) && (block_ptr->block_number != block_number) )
    {
        indx++;
        block_ptr++;
    }

    if ( indx == e_eeprom_xmc1_handle->block_count )
    {
        indx = E_EEPROM_XMC1_LOG_BLOCK_NOT_FOUND;
    }
    return (indx);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lGetDFLASHPhysicalBlocks
 ********************************************************************************
 * Summary:
 * Calculates and return the number of FLASH blocks required for a user data
 * block size.
 *
 * Parameters:
 * size - size of user data block
 *
 * Return:
 * uint32_t - returns maximum physical flash blocks required to store the data.
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lGetDFLASHPhysicalBlocks(uint32_t size)
{
    uint32_t physical_blocks;

    physical_blocks = 1U;
    /* If size is greater than the  */
    if ( size > E_EEPROM_XMC1_BLOCK1_DATA_SIZE )
    {
        size = size - E_EEPROM_XMC1_BLOCK1_DATA_SIZE;
        physical_blocks++;

        while (size > E_EEPROM_XMC1_BLOCK2_DATA_SIZE)
        {
            physical_blocks++;
            size = size - E_EEPROM_XMC1_BLOCK2_DATA_SIZE;
        }
    }
    return(physical_blocks);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lGetFreeDFLASHBlocks
 ********************************************************************************
 * Summary:
 * This routine will calculate the number of empty DFLASH blocks remaining in the bank.
 *
 * Parameters:
 * void
 *
 * Return:
 * uint32_t : Number of physical blocks left in the bank for writing data.
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lGetFreeDFLASHBlocks(void)
{
    uint32_t base_addr;
    uint32_t free_blocks;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    if (data_ptr->current_bank == 0U)
    {
        base_addr = E_EEPROM_XMC1_FLASH_BANK0_BASE;
    }
    else
    {
        base_addr = E_EEPROM_XMC1_FLASH_BANK1_BASE;
    }
    free_blocks = (uint32_t)( ( (base_addr + E_EEPROM_XMC1_FLASH_BANK_SIZE) - (data_ptr->next_free_block_addr)  )
            /  E_EEPROM_XMC1_FLASH_BLOCK_SIZE );
    return (free_blocks);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lUpdateCurrBankInfo
 ********************************************************************************
 * Summary:
 * Updates global addresses to keep track of writing and reading operations
 * respectively.
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lUpdateCurrBankInfo(void)
{
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    if (data_ptr->current_bank == 0U)
    {
        data_ptr->curr_bank_src_addr = E_EEPROM_XMC1_FLASH_BANK0_BASE;
        data_ptr->gc_src_addr = E_EEPROM_XMC1_FLASH_BANK0_BASE;
        data_ptr->gc_dest_addr = E_EEPROM_XMC1_FLASH_BANK1_BASE;
        data_ptr->curr_bank_end_addr = E_EEPROM_XMC1_FLASH_BANK0_END;
        data_ptr->prev_bank_end_addr = E_EEPROM_XMC1_FLASH_BANK1_END;
    }
    else
    {
        data_ptr->curr_bank_src_addr = E_EEPROM_XMC1_FLASH_BANK1_BASE;
        data_ptr->gc_src_addr = E_EEPROM_XMC1_FLASH_BANK1_BASE;
        data_ptr->gc_dest_addr = E_EEPROM_XMC1_FLASH_BANK0_BASE;
        data_ptr->curr_bank_end_addr = E_EEPROM_XMC1_FLASH_BANK1_END;
        data_ptr->prev_bank_end_addr = E_EEPROM_XMC1_FLASH_BANK0_END;
    }
}

