Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lReadMarkerBlocks
 ********************************************************************************
 * Summary:
 * This function will read the Block marker contents
 *
 * Parameters:
 * void
 *
 * Return:
 * uint32_t : marker_dirty_state
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lReadMarkerBlocks(void)
{
    uint32_t indx;
    uint32_t bank;
    uint32_t block;
    uint32_t temp_bank_state;
    uint32_t state_marker_cnt;
    uint32_t temp_state_marker;
    uint32_t marker_dirty_state;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /* Initialize Local variables */
    temp_bank_state = 0U;
    marker_dirty_state = 0U;
    state_marker_cnt = 0U;
    do
    {
        /* Prepare the variables for state block update */
        temp_bank_state = (uint32_t)((uint32_t)temp_bank_state << (uint32_t)1U);

        bank  = (uint32_t)state_marker_cnt >> E_EEPROM_XMC1_TWO_BIT_POS;
        block = (uint32_t)state_marker_cnt - ((uint32_t)bank << E_EEPROM_XMC1_TWO_BIT_POS);

        /* Read the state block of bank*/
        temp_state_marker = E_EEPROM_XMC1_lReadVerifyMarker(bank , block);

        if (temp_state_marker == E_EEPROM_XMC1_ALL_ONES)
        {
            temp_bank_state |= 1U;
        }
        else if (temp_state_marker == E_EEPROM_XMC1_ALL_ZEROS)
        {
            temp_bank_state |= 0U;
        }
        else
        {
            indx = (uint32_t)((uint32_t)state_marker_cnt >> E_EEPROM_XMC1_TWO_BIT_POS);
            marker_dirty_state |= (uint32_t)((uint32_t)1U << (uint32_t)indx);
        }
        /* Update the counter "StateBlockCnt" */
        state_marker_cnt++;
    } while (state_marker_cnt < E_EEPROM_XMC1_EIGHT_BYTES);

    /* Update Global variables */
    data_ptr->init_gc_state = temp_bank_state;

    return (marker_dirty_state);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lReadVerifyMarker
 ********************************************************************************
 * Summary:
 * This function will verify the marker contents read out from state page.
 *
 * Parameters:
 * Bank  - Bank Number ( 0 / 1 )
 * Block - Block position
 *
 * Return:
 * uint32_t : E_EEPROM_XMC1_ALL_ONES
 * E_EEPROM_XMC1_ALL_ZEROS
 * E_EEPROM_XMC1_MB_DIRTY
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lReadVerifyMarker(uint32_t bank, uint32_t block)
{
    uint32_t indx;
    uint32_t return_val;
    uint32_t ones_counter;
    uint32_t zeros_counter;
    uint32_t marker_block_addr;
    uint32_t *marker_array_ptr;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    ones_counter = 0U;
    zeros_counter = 0U;
    marker_array_ptr = (uint32_t*)(void*)data_ptr->read_write_buffer;

    /* Calculate the Marker Block address from bank and Block size*/
    marker_block_addr = (E_EEPROM_XMC1_FLASH_BANK0_BASE +
            ((uint32_t)bank  * (uint32_t)E_EEPROM_XMC1_FLASH_BANK_SIZE)) +
                    ((uint32_t)block * (uint32_t)E_EEPROM_XMC1_FLASH_BLOCK_SIZE);

    /* Clear all error status flags before flash operation*/
    XMC_FLASH_ClearStatus();

    /* Read one complete block of data (4 Words = 128 bit) from the targeted Marker Block */
    E_EEPROM_XMC1_lReadSingleBlock(marker_block_addr, (uint32_t*)(void*)marker_array_ptr);

    /* Check for any flash hardware errors*/
    if (E_EEPROM_XMC1_lGetFlashStatus())
    {
        /* Any Hardware errors will result in Dirty state*/
        return_val = E_EEPROM_XMC1_MB_DIRTY;
    }
    else
    {
        for (indx = 0U ; indx <E_EEPROM_XMC1_MAX_WORDS_IN_BLOCK ; indx++)
        {
            /* Check for the Marker field and verify Marker either 0 or 1*/
            if (*(marker_array_ptr + indx) == E_EEPROM_XMC1_ALL_ZEROS)
            {
                zeros_counter++;
            }

            if (*(marker_array_ptr + indx) == E_EEPROM_XMC1_ALL_ONES)
            {
                ones_counter++;
            }
        }
        if (ones_counter == E_EEPROM_XMC1_FOUR_BYTES)
        {
            return_val = E_EEPROM_XMC1_ALL_ONES;
        }
        else if (zeros_counter == E_EEPROM_XMC1_FOUR_BYTES)
        {
            return_val = E_EEPROM_XMC1_ALL_ZEROS;
        }
        else
        {
            return_val = E_EEPROM_XMC1_MB_DIRTY;
        }
    }
    return (return_val);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lSetMarkerBlockBuffer
 ********************************************************************************
 * Summary:
 * This function will update the write buffer for a particular bank marker state
 *
 * Parameters:
 * void
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lSetMarkerBlockBuffer(void)
{
    uint32_t *array_ptr;
    uint32_t indx;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    array_ptr = (uint32_t*)(void*)data_ptr->read_write_buffer;
    for (indx = 0U ; indx < E_EEPROM_XMC1_FOUR_BYTES; indx++)
    {
        array_ptr[indx] = E_EEPROM_XMC1_ALL_ZEROS;
    }

}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lSetMarkerPageBuffer
 ********************************************************************************
 * Summary:
 * Fill complete Marker PAGE as per the below defined format.
 *
 *                          WORD - 0      WORD - 1      WORD - 2     WORD - 3
 *
 *             BLOCK0 -  (ZEROS/ONES)  (ZEROS/ONES)   (ZEROS/ONES)   (ZEROS/ONES)
 *             BLOCK1 -  (ZEROS/ONES)  (ZEROS/ONES)   (ZEROS/ONES)   (ZEROS/ONES)
 *             BLOCK2 -  (ZEROS/ONES)  (ZEROS/ONES)   (ZEROS/ONES)   (ZEROS/ONES)
 *             BLOCK3 -  (ZEROS/ONES)  (ZEROS/ONES)   (ZEROS/ONES)   (ZEROS/ONES)
 *             BLOCK4 -  (0xFFFFFFFF)  (0xFFFFFFFF)   (0xFFFFFFFF)   (0xFFFFFFFF)
 *             BLOCK5 -  (0xFFFFFFFF)  (0xFFFFFFFF)   (0xFFFFFFFF)   (0xFFFFFFFF)
 *           ----------------------------------------------------------------------
 *           ----------------------------------------------------------------------
 *             BLOCK16-  (0xFFFFFFFF)  (0xFFFFFFFF)   (0xFFFFFFFF)   (0xFFFFFFFF)
 *
 * Parameters:
 * State - Marker State
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lSetMarkerPageBuffer(uint32_t state)
{
    uint32_t indx;
    uint32_t bit_mask;
    uint32_t word_data;
    uint32_t *array_ptr;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    array_ptr = (uint32_t*)(void*)data_ptr->page_write_buffer;
    /*
     * Depending upon the state received check the bit positions where a state marker has to be updated to
     * get the actual state. Fill the first four blocks of the page with the state marker information.
     */

    /* Fill the first rest 4 blocks of the page with marker data  */
    for (bit_mask = 0U;bit_mask < E_EEPROM_XMC1_MARKER_MAX_SHIFT;bit_mask++)
    {
        if ( (state & (E_EEPROM_XMC1_MARKER_POSITION >> bit_mask )) == 0U )
        {
            word_data = E_EEPROM_XMC1_ALL_ZEROS;
        }
        else
        {
            word_data = E_EEPROM_XMC1_ALL_ONES;
        }
        for ( indx = 0U; indx< E_EEPROM_XMC1_MAX_WORDS_IN_BLOCK ; indx++ )
        {
            *array_ptr = word_data;
            array_ptr++;
        }

