Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
    }
    /* Fill the first rest 12 blocks of the page with all ones*/
    for (indx = 0U; indx < E_EEPROM_XMC1_PAGE1_EXTRA_WORDS; indx++)
    {
        *array_ptr = E_EEPROM_XMC1_ALL_ONES;
        array_ptr++;
    }

}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lEraseBank
 ********************************************************************************
 * Summary:
 * Erases the particular bank
 *
 * Parameters:
 * page_address - Bank end address
 *
 * Return:
 * uint32_t - Flash NVM_STATUS register value
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lEraseBank(uint32_t page_address)
{
    uint32_t indx;
    uint32_t status;
    /* Clear all error status flags before flash operation*/
    page_address = ((page_address) - E_EEPROM_XMC1_FLASH_PAGE_SIZE );
    page_address += 1U;
    indx = 0U;

    do
    {
        /* Clear all error status flags before flash operation*/
        XMC_FLASH_ClearStatus();

        E_EEPROM_XMC1_lEraseSinglePage(page_address);

        status = E_EEPROM_XMC1_lGetFlashStatus();

        page_address = page_address - (E_EEPROM_XMC1_FLASH_PAGE_SIZE );
        indx++;
    } while ((indx <E_EEPROM_XMC1_BANK_PAGES) && (status == 0U));

    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lGCWrite
 ********************************************************************************
 * Summary:
 * Local function to write data into specified location during GC operation
 *
 * Parameters:
 * block_address  - flash address
 *
 * Return:
 * uint32_t - Flash NVM_STATUS register value
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lGCWrite(uint32_t block_address)
{
    uint32_t status;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    /* Clear all error status flags before flash operation*/
    XMC_FLASH_ClearStatus();

    /* Write a single block into flash*/
    E_EEPROM_XMC1_lWriteSingleBlock(block_address, (uint32_t*)(void*)data_ptr->read_write_buffer);
    status = E_EEPROM_XMC1_lGetFlashStatus();
    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lLocalWrite
 ********************************************************************************
 * Summary:
 * Common local write function to do write block function or invalidate block.
 *
 * Parameters:
 * block_number   - User block number / ID
 * data_buffer_ptr - Data buffer address
 * invalidate    - (0 = normal write / 1 = invalidate block)
 *
 * Return:
 * uint32_t - Flash NVM_STATUS register value
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lLocalWrite( uint8_t block_number,
        uint8_t* data_buffer_ptr,
        uint32_t invalidate)
{
    uint32_t status;
    uint32_t flash_blocks;
    uint32_t perform_write;
    uint32_t user_block_index;
    uint32_t remaining_blocks;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_BLOCK_t *block_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    status = 0U;
    perform_write = 0U;
    user_block_index = E_EEPROM_XMC1_lGetUsrBlockIndex(block_number);
    block_ptr = e_eeprom_xmc1_handle->block_config_ptr + user_block_index;

    flash_blocks = E_EEPROM_XMC1_lGetDFLASHPhysicalBlocks(block_ptr->size);
    remaining_blocks = E_EEPROM_XMC1_lGetFreeDFLASHBlocks();

    if (remaining_blocks < flash_blocks)
    {
        /* Doesn't do Garbage collection if, GUI option garbage collection is disabled*/
        if (e_eeprom_xmc1_handle->garbage_collection == 1U)
        {
            /* Request for Garbage Collection and continue */
            data_ptr->gc_state = E_EEPROM_XMC1_GC_REQUESTED;
            E_EEPROM_XMC1_lGarbageCollection();

            /*Check the size of the GC requested block to check if space is available in the new bank or not.*/
            flash_blocks = E_EEPROM_XMC1_lGetDFLASHPhysicalBlocks(block_ptr->size);
            remaining_blocks = E_EEPROM_XMC1_lGetFreeDFLASHBlocks();

            /* Check for GC overflows the complete space in the new bank, hence cant write the GC triggered block*/
            if ((remaining_blocks >= flash_blocks)&&(data_ptr->gc_state == E_EEPROM_XMC1_GC_IDLE))
            {
                perform_write = 1U;
            }
            else
            {
                status = (uint32_t)E_EEPROM_XMC1_OPERATION_STATUS_NOT_ALLOWED;
            }
        }
        else
        {
            status = (uint32_t)E_EEPROM_XMC1_OPERATION_STATUS_MEMORY_BANK_FULL;
        }
    }
    else
    {
        perform_write = 1U;
    }
    /* Write operation Starts */
    if (perform_write == 1U)
    {
        data_ptr->written_block_counter = 0U;
        if (invalidate == 1U)
        {
            status = E_EEPROM_XMC1_lHandleInvalidReq(block_number, user_block_index);
        }
        else
        {
            status = E_EEPROM_XMC1_lHandleWriteReq(block_number, data_buffer_ptr);
        }
        if (status != 0U)
        {
            status = (uint32_t)E_EEPROM_XMC1_OPERATION_STATUS_FAILURE;
        }
    }
    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lHandleWriteReq
 ********************************************************************************
 * Summary:
 * Handle function to write one complete data block into flash.
 *
 * Parameters:
 * block_number   - User block number / ID
 * data_buffer_ptr - Data buffer address
 *
 * Return:
 * uint32_t - Flash NVM_STATUS register value
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lHandleWriteReq(uint8_t block_number, uint8_t* data_buffer_ptr)
{
    uint32_t block_size;
    uint32_t user_block_index;
    uint32_t status;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_BLOCK_t *block_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);


