Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
    user_block_index = E_EEPROM_XMC1_lGetUsrBlockIndex(block_number);
    block_ptr = e_eeprom_xmc1_handle->block_config_ptr + user_block_index;
    block_size = block_ptr->size;
    data_ptr->user_write_bytes_count = 0U;
    data_ptr->user_write_state = E_EEPROM_XMC1_FIRST_BLOCK_WRITE;
    status = 0U;
    do
    {
        switch (data_ptr->user_write_state)
        {
        case E_EEPROM_XMC1_NEXT_BLOCK_WRITE:
            status = E_EEPROM_XMC1_lWriteDataBlock();
            if (status == (uint32_t)0U)
            {
                E_EEPROM_XMC1_lPopulateNextBlock(block_number,data_buffer_ptr,block_size);
            }
            break;

        case E_EEPROM_XMC1_LAST_BLOCK_WRITE:
            status = E_EEPROM_XMC1_lWriteDataBlock();
            if (status == (uint32_t)0U)
            {
                /* Mark the block as inconsistent */
                data_ptr->block_info[user_block_index].address = data_ptr->next_free_block_addr;
                data_ptr->block_info[user_block_index].status.valid = 1U;
                data_ptr->block_info[user_block_index].status.consistent = 1U;
                if (e_eeprom_xmc1_handle->data_block_crc ==1U)
                {
                    /* Updated Cache table Block Header status as CRC enabled block*/
                    data_ptr->block_info[user_block_index].status.crc = 1U;
                }
                else
                {
                    /* Updated Cache table Block Header status as CRC disabled block*/
                    data_ptr->block_info[user_block_index].status.crc = 0U;
                }

                data_ptr->user_write_state = E_EEPROM_XMC1_BLOCK_WRITE_IDLE;
            }
            break;

        default:
            E_EEPROM_XMC1_lPopulateFirstBlock(block_number,data_buffer_ptr,block_size); /* E_EEPROM_XMC1_FIRST_BLOCK_WRITE*/
            break;
        }
    } while ( (status == 0U) && (data_ptr->user_write_state != E_EEPROM_XMC1_BLOCK_WRITE_IDLE) );

    data_ptr->next_free_block_addr = (uint32_t)(data_ptr->next_free_block_addr +
            (data_ptr->written_block_counter * E_EEPROM_XMC1_FLASH_BLOCK_SIZE));
    if (status != 0U)
    {
        data_ptr->block_info[user_block_index].status.valid = 1U;
        data_ptr->block_info[user_block_index].status.consistent = 0U;
    }
    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lHandleInvalidReq
 ********************************************************************************
 * Summary:
 * Write one block with all data element as 0xFF to invalidate a block.
 *
 * Parameters:
 * block_number - User block number / ID
 * user_block_index  - Index of the logical block
 *
 * Return:
 * uint32_t - Flash NVM_STATUS register value
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lHandleInvalidReq(uint8_t block_number, uint32_t  user_block_index)
{
    uint32_t status;
    uint32_t data_byte_count;
    uint8_t* read_write_buffer_ptr;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);
    read_write_buffer_ptr = data_ptr->read_write_buffer;
    *read_write_buffer_ptr = block_number;
    *(read_write_buffer_ptr + 1U) = (E_EEPROM_XMC1_START_BIT);


    for (data_byte_count = E_EEPROM_XMC1_TWO_BYTES;data_byte_count < E_EEPROM_XMC1_FLASH_BLOCK_SIZE;data_byte_count++)
    {
        *((uint8_t *)(void *)(read_write_buffer_ptr + data_byte_count)) = E_EEPROM_XMC1_8BIT_ALL_ONE;
    }

    status = E_EEPROM_XMC1_lWriteDataBlock();

    if (status == 0U)
    {
        data_ptr->block_info[user_block_index].status.consistent = 1U;
        data_ptr->block_info[user_block_index].address = data_ptr->next_free_block_addr;
    }
    else
    {
        data_ptr->block_info[user_block_index].status.consistent = 0U;
    }

    data_ptr->block_info[user_block_index].status.valid = 0U;
    data_ptr->next_free_block_addr = (E_EEPROM_XMC1_FLASH_BLOCK_SIZE + (uint32_t)(data_ptr->next_free_block_addr));

    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lPopulateFirstBlock
 ********************************************************************************
 * Summary:
 * Populates the first block with data elements starting from the passed data
 * buffer address.
 *
 * Parameters:
 * block_number   - User block number / ID
 * data_buffer_ptr - Data buffer address
 * block_size - Length of data to be read
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lPopulateFirstBlock(uint8_t block_number,
        uint8_t* user_data_buffer_ptr,
        uint32_t block_size)
{
    uint32_t crc_bit;
    uint32_t crc_buffer;
    uint32_t data_byte_count;
    uint8_t* read_write_buffer_ptr;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);
    read_write_buffer_ptr = data_ptr->read_write_buffer;
    data_ptr->user_write_state = E_EEPROM_XMC1_NEXT_BLOCK_WRITE;

#ifdef E_EEPROM_XMC1_CRC_SW_ENABLED
    /* IF Block CRC is enabled then update the block Header with 16 bit CRC calculated from the data buffer*/
    CRC_SW_CalculateCRC(e_eeprom_xmc1_handle->crc_handle_ptr,user_data_buffer_ptr,block_size);
    crc_buffer = CRC_SW_GetCRCResult(e_eeprom_xmc1_handle->crc_handle_ptr);
    crc_bit = E_EEPROM_XMC1_CRC_BIT;
#else
    crc_buffer = E_EEPROM_XMC1_DUMMY_CRC;
    crc_bit = 0U;
#endif

    /* Populate header block with block number, status bits and CRC buffer. Hence 4 bytes shift for data byte Count*/
    *((uint32_t *)(void *)(read_write_buffer_ptr)) = (uint32_t)((block_number) |
            (uint32_t)((E_EEPROM_XMC1_START_BIT | E_EEPROM_XMC1_VALID_BIT |
                    crc_bit) << E_EEPROM_XMC1_EIGHT_BIT_POS) |
                    (uint32_t)(crc_buffer << E_EEPROM_XMC1_CRC_SHIFT));
    data_byte_count = E_EEPROM_XMC1_FOUR_BYTES;
    /* Add data to the write buffer from the user specified pointer */
    do
    {
        if (data_ptr->user_write_bytes_count < block_size  )
        {
            *(read_write_buffer_ptr + data_byte_count) = *(user_data_buffer_ptr + data_ptr->user_write_bytes_count);
            (data_ptr->user_write_bytes_count)++;
        }
        else
        {
            *(read_write_buffer_ptr + data_byte_count) = E_EEPROM_XMC1_8BIT_ALL_ONE;
        }
        data_byte_count++;

    } while ( data_byte_count != E_EEPROM_XMC1_FLASH_BLOCK_SIZE); /* Check for block size overflow*/

    if (data_ptr->user_write_bytes_count >= block_size)
    {
        data_ptr->user_write_state = E_EEPROM_XMC1_LAST_BLOCK_WRITE;
    }
}

