Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lPopulateNextBlock
 ********************************************************************************
 * Summary:
 * Populates the successive blocks with data elements starting from the passed data
 * buffer address.
 *
 * Parameters:
 * block_number   - User block number / ID
 * data_buffer_ptr - Data buffer address
 * block_size - Length of data to be read
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lPopulateNextBlock( uint8_t block_number ,
        uint8_t*  const user_data_buffer_ptr ,
        uint32_t block_size)
{
    uint32_t  data_byte_count;
    uint8_t*  read_write_buffer_ptr;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    read_write_buffer_ptr = data_ptr->read_write_buffer;
    *(read_write_buffer_ptr) = block_number;
    *(read_write_buffer_ptr + 1U) = E_EEPROM_XMC1_VALID_BIT;
    data_byte_count = E_EEPROM_XMC1_TWO_BYTES;

    /* Add data to the write buffer from the user specified pointer */
    do
    {
        if (data_ptr->user_write_bytes_count < block_size )
        {
            *(read_write_buffer_ptr + data_byte_count) = *(user_data_buffer_ptr + data_ptr->user_write_bytes_count);
            (data_ptr->user_write_bytes_count)++;
        }
        else
        {
            *(read_write_buffer_ptr + data_byte_count) = E_EEPROM_XMC1_8BIT_ALL_ONE;
            data_ptr->user_write_state = E_EEPROM_XMC1_LAST_BLOCK_WRITE;
        }
        data_byte_count++;

    } while ( data_byte_count != E_EEPROM_XMC1_FLASH_BLOCK_SIZE);

    if (data_ptr->user_write_bytes_count >= block_size)
    {
        data_ptr->user_write_state = E_EEPROM_XMC1_LAST_BLOCK_WRITE;
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lWriteDataBlock
 ********************************************************************************
 * Summary:
 * Writes single data block into flash
 *
 * Parameters:
 * void
 *
 * Return:
 * uint32_t - NVM_STATUS register value after read operation
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lWriteDataBlock(void)
{
    uint32_t status;
    uint32_t src_addr;
    E_EEPROM_XMC1_DATA_t *data_ptr;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);

    src_addr = (uint32_t)(data_ptr->next_free_block_addr +
            (data_ptr->written_block_counter * E_EEPROM_XMC1_FLASH_BLOCK_SIZE));
    (data_ptr->written_block_counter)++;

    XMC_FLASH_ClearStatus();
    E_EEPROM_XMC1_lWriteSingleBlock(src_addr, (uint32_t*)(void*)data_ptr->read_write_buffer);
    status = E_EEPROM_XMC1_lGetFlashStatus();

    return (status);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lReadBlockContents
 ********************************************************************************
 * Summary:
 * Read data bytes starting from specified address (data_buffer_ptr + offset).
 * Read number of bytes as specified in the length parameter.
 *
 * Parameters:
 * data_buffer_ptr - Data buffer address
 * length - Length of data to be read
 * offset - Offset from which the read shall start
 *
 * Return:
 * E_EEPROM_XMC1_STATUS_t
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lReadBlockContents(uint8_t *const data_buffer_ptr, uint32_t length, uint32_t offset)
{
    uint32_t indx;
    uint32_t status;
    uint32_t block_count;
    uint32_t flash_address;
    uint32_t block_start_address;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    uint32_t remaining_bytes_in_curr_block;

    indx = 0U;
    status = 0U;
    block_count = 0U;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);
    block_start_address = data_ptr->read_start_address;

    if (offset >= E_EEPROM_XMC1_BLOCK1_DATA_SIZE)  /* Check if the offset does'nt fit in the first data block.  */
    {
        block_count++;                        /* If not then increment block counter*/
        offset = offset - E_EEPROM_XMC1_BLOCK1_DATA_SIZE;  /* subtract the data size of first block (12 bytes)*/
        while (offset >= E_EEPROM_XMC1_BLOCK2_DATA_SIZE)   /* Check the exact block where the offset fit inside  */
        {
            block_count++;                        /* If not then increment block counter*/
            offset = offset - E_EEPROM_XMC1_BLOCK2_DATA_SIZE; /* subtract the data size of next block (14 bytes)*/
        }
        offset += E_EEPROM_XMC1_BLOCK2_DATA_OFFSET;
    }
    else
    {
        offset += E_EEPROM_XMC1_BLOCK1_DATA_OFFSET;
    }
    /* Remaining bytes in the block where Read offset is pointing*/
    remaining_bytes_in_curr_block = E_EEPROM_XMC1_FLASH_BLOCK_SIZE - offset;

    do
    {
        /* Calculate the Flash address of the block to be read*/
        flash_address = block_start_address + ((uint32_t)block_count * E_EEPROM_XMC1_FLASH_BLOCK_SIZE);

        XMC_FLASH_ClearStatus();
        E_EEPROM_XMC1_lReadSingleBlock(flash_address,(uint32_t*)(void*)data_ptr->read_write_buffer);
        status = E_EEPROM_XMC1_lGetFlashStatus();

        if (status != 0U)
        {
            break;
        }
        /* Extract the data read from flash byte by byte and load into the user buffer*/
        do{

            *(data_buffer_ptr + indx) = *(data_ptr->read_write_buffer + offset);
            indx++;
            offset++;
            length--;
            remaining_bytes_in_curr_block--;

            /* check any of the length parameters reaches 0 */
        } while ( (remaining_bytes_in_curr_block) && (length) );

        /* Check if the length of bytes pending to be read is within the range of available bytes in the block */
        if (length <= E_EEPROM_XMC1_BLOCK2_DATA_SIZE)
        {
            /* Force remaining bytes in current block to length remaining */
            remaining_bytes_in_curr_block = length;
        }
        else
        {
            /* Force remaining bytes to next block size(14)*/
            remaining_bytes_in_curr_block = E_EEPROM_XMC1_BLOCK2_DATA_SIZE;
        }

        offset = E_EEPROM_XMC1_BLOCK2_DATA_OFFSET;     /* Shift offset by 2 counts to avoid next block header */
        block_count++;                        /* Increment the block count to read next block */

    } while (length != 0U);

    return (status);
}

