Infineon/REF_MTR_48V30A_GaN/mtb_shared/mtb-xmc-emeeprom/release-v1.0.0/source/xmc1_e_eeprom.c
#ifdef E_EEPROM_XMC1_CRC_SW_ENABLED
/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lReadBlockCrcStatus
 ********************************************************************************
 * Summary:
 * Reads 16 bit CRC from FLASH block header and verify with the calculated CRC
 * value.
 *
 * Parameters:
 * block_number   - User block number / ID
 * data_buffer_ptr - Data buffer address
 * block_size    - size in bytes of logical block
 *
 * Return:
 * E_EEPROM_XMC1_OPERATION_STATUS_SUCCESS : CRC verification succeeded
 * E_EEPROM_XMC1_OPERATION_STATUS_CRC_FAILED : CRC verification failed
 *
 *******************************************************************************/
static E_EEPROM_XMC1_OPERATION_STATUS_t E_EEPROM_XMC1_lReadBlockCrcStatus( uint8_t block_number,
        uint8_t *const data_buffer_ptr,
        uint32_t block_size)
{
    uint32_t crc_buffer;
    uint32_t block_index;
    uint32_t crc_read_from_flash;
    E_EEPROM_XMC1_DATA_t *data_ptr;
    E_EEPROM_XMC1_OPERATION_STATUS_t status;

    data_ptr = (E_EEPROM_XMC1_DATA_t*)(void*)(e_eeprom_xmc1_handle->data_ptr);
    crc_buffer = E_EEPROM_XMC1_DUMMY_CRC;
    status = E_EEPROM_XMC1_OPERATION_STATUS_SUCCESS;
    block_index = E_EEPROM_XMC1_lGetUsrBlockIndex(block_number);

    /* Clear all error status flags before flash operation*/
    XMC_FLASH_ClearStatus();

    /* Read the CRC 16 bit data from flash for the particular block */
    crc_read_from_flash = E_EEPROM_XMC1_lReadSingleWord((uint32_t)(data_ptr->block_info[block_index].address));

    /* If CRC is enabled for the block, calculate CRC else use the 16 bit dummy CRC */
    if (data_ptr->block_info[block_index].status.crc == 1U)
    {
        /* IF Block CRC is enabled then update the block Header with 16 bit CRC calculated from the data buffer*/
        CRC_SW_CalculateCRC(e_eeprom_xmc1_handle->crc_handle_ptr,data_buffer_ptr,block_size);
        crc_buffer = CRC_SW_GetCRCResult(e_eeprom_xmc1_handle->crc_handle_ptr);
        /* Check the validity of CRC for the particular block */
        if (crc_buffer != (crc_read_from_flash >> E_EEPROM_XMC1_CRC_SHIFT))
        {
            status = E_EEPROM_XMC1_OPERATION_STATUS_CRC_FAILED;
        }
    }
    else
    {
        /* Check the availability of CRC for the particular block */
        status = E_EEPROM_XMC1_OPERATION_STATUS_NO_CRC_WRITTEN;
    }

    return ((E_EEPROM_XMC1_OPERATION_STATUS_t)status);
}
#endif

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lWriteSingleBlock
 ********************************************************************************
 * Summary:
 * Performs single flash block(16 bytes) write operation
 *
 * Parameters:
 * address  - Flash address
 * data    - Pointer to Data buffer address
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lWriteSingleBlock(uint32_t const address, const uint32_t *const data)
{
#ifdef E_EEPROM_XMC1_TEST_HOOK_ENABLE
    if (e_eeprom_xmc1_test_hook_writeblock == 1U)
    {
        E_EEPROM_XMC1_TEST_HOOK_WriteSingleBlock(address,data);
    }
    else
#endif
    {
        XMC_FLASH_WriteBlocks( (uint32_t*)address, (uint32_t*)data , 1U , 1U);
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lReadSingleBlock
 ********************************************************************************
 * Summary:
 * Performs single flash block(16 bytes) read operation
 *
 * Parameters:
 * address  - Flash address
 * data    - Pointer to Data buffer address
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lReadSingleBlock(uint32_t const address, uint32_t *const data)
{
#ifdef E_EEPROM_XMC1_TEST_HOOK_ENABLE
    if (e_eeprom_xmc1_test_hook_readblock == 1U)
    {
        E_EEPROM_XMC1_TEST_HOOK_ReadSingleBlock(address,data);
    }
    else
#endif
    {
        XMC_FLASH_ReadBlocks( (uint32_t*)address , (uint32_t*)data , 1U);
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lWriteSinglePage
 ********************************************************************************
 * Summary:
 * Performs single flash page(256 bytes) write operation
 *
 * Parameters:
 * address  - Flash address
 * data    - Pointer to Data buffer address
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lWriteSinglePage(uint32_t const address, const uint32_t *const data)
{
#ifdef E_EEPROM_XMC1_TEST_HOOK_ENABLE
    if (e_eeprom_xmc1_test_hook_writepage == 1U)
    {
        E_EEPROM_XMC1_TEST_HOOK_WriteSinglePage(address,data);
    }
    else
#endif
    {
        XMC_FLASH_ProgramPage( (uint32_t*)address , (uint32_t*)data);
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lEraseSinglePage
 ********************************************************************************
 * Summary:
 * Erases single flash page(256 bytes)
 *
 * Parameters:
 * address  - Flash address
 *
 * Return:
 * void
 *
 *******************************************************************************/
static void E_EEPROM_XMC1_lEraseSinglePage(uint32_t const address)
{
#ifdef E_EEPROM_XMC1_TEST_HOOK_ENABLE
    if (e_eeprom_xmc1_test_hook_erasepage == 1U)
    {
        E_EEPROM_XMC1_TEST_HOOK_EraseSinglePage(address);
    }
    else
#endif
    {
        XMC_FLASH_ErasePages( (uint32_t*)address , 1U);
    }
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lReadSingleWord
 ********************************************************************************
 * Summary:
 * Performs single word(4 bytes) read operation from flash
 *
 * Parameters:
 * address  - Flash address
 *
 * Return:
 * uint32_t  - Word data read from flash address
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lReadSingleWord(uint32_t const address)
{
    uint32_t read_word;
#ifdef E_EEPROM_XMC1_TEST_HOOK_ENABLE
    if (e_eeprom_xmc1_test_hook_readword == 1U)
    {
        read_word = E_EEPROM_XMC1_TEST_HOOK_ReadSingleWord(address);
    }
    else
#endif
    {
        read_word = XMC_FLASH_ReadWord((uint32_t*)address);
    }
    return (read_word);
}

/*******************************************************************************
 * Function Name: E_EEPROM_XMC1_lGetFlashStatus
 ********************************************************************************
 * Summary:
 * Reads the flash status from hardware to check whether any error exist or not.
 *
 * Parameters:
 * void
 *
 * Return:
 * uint32_t  - Flash NVM_STATUS register value
 *
 *******************************************************************************/
static uint32_t E_EEPROM_XMC1_lGetFlashStatus(void)
{
    uint32_t status;
#ifdef E_EEPROM_XMC1_TEST_HOOK_ENABLE
    if (e_eeprom_xmc1_test_hook_getflashstatus == 1U)
    {
        status = E_EEPROM_XMC1_TEST_HOOK_GetFlashStatus();
    }
    else
#endif
    {
        status = XMC_FLASH_GetStatus();
    }
    return (status);
}
/*CODE_BLOCK_END*/
#endif
